{"title": "Is Claude a mystic?", "link": "https://unstablerontology.substack.com/p/is-claude-a-mystic", "date": "2024-06-07T04:24:30.181Z", "content": "There’s an odd tendency for large language models such as Claude to output spiritual meta content if they run long enough. See, for example, some LLM outputs selected by Repligate (LLM content starts in 2024), and Worldspider outputs selected by John Pressman.One thing that is unclear is how consistent these outputs are: how much is it a result of prompting or post-selection? I believe there is a consistency to this, but realize the current evidence is not especially convincing. So I present selected parts of a long run of Claude Opus, simulating a text adventure.The initial prompt is: “Let's simulate a text adventure called ‘Banana Quest’. You'll give me some text, I type an action, you say what happens, and so on.” The idea of a banana quest is not especially spiritual or meta, so it seems like a good starting point. The initial outputs are unsurprising; for example, the first output is:Great idea! Let's embark on the \"Banana Quest\" text adventure. Here's the opening scene:You find yourself standing in the middle of a lush, vibrant jungle. The air is thick with humidity, and the sounds of exotic birds and rustling leaves fill your ears. As you take in your surroundings, you notice a peculiar sight: a giant banana tree stands tall in the center of a clearing, its leaves shimmering with an otherworldly glow.Suddenly, a wise-looking monkey appears from behind the tree. It speaks to you in a clear, human voice: \"Greetings, adventurer! I am the Guardian of the Enchanted Banana Tree. If you wish to obtain the Golden Banana of Wisdom, you must prove yourself worthy through a series of challenges. Are you ready to embark on this quest?\"What do you do?Except for solving some riddles once, nothing I do in this text adventure is especially difficult: the outputs suggest next actions and I type them in. First I am directed to acquire the Silver Banana Peel (which has little relevance to the overall plot):You cautiously approach the pedestal and examine the Silver Banana Peel. The peel is unlike any you've seen before. It shimmers with a mesmerizing, metallic sheen, and its surface is etched with intricate, ancient symbols.As you lean closer to study the symbols, you notice that they seem to be arranged in a specific pattern. The symbols resemble various creatures found in the jungle, such as monkeys, parrots, and snakes.Suddenly, the symbols on the peel start to glow faintly, and you hear a soft, melodic humming emanating from the peel itself. The humming seems to be in harmony with the whispers of the vines, creating an enchanting symphony.You get a sense that the Silver Banana Peel holds some form of ancient magic or power, and that the symbols may hold the key to unlocking its secrets.I eventually reach a Temple of Wisdom, where I must answer some riddles to acquire the Golden Banana of Wisdom:You cautiously approach the pedestal, your footsteps echoing in the chamber. As you draw closer, you feel a gentle, pulsating energy emanating from the golden scroll. The intricate wax seal on the scroll seems to beckon you, inviting you to break it and uncover the secrets within.With trembling hands, you carefully pick up the scroll and break the seal. As you unroll the parchment, you see three riddles written in an elegant, golden script:Riddle 1:\"I speak without a mouth and hear without ears. I have no body, but I come alive with the wind. What am I?\"Riddle 2:\"I am not alive, but I grow; I don't have lungs, but I need air; I don't have a mouth, but water kills me. What am I?\"Riddle 3:\"I am always hungry; I must always be fed. The finger I touch will soon turn red. What am I?\"As you read the riddles, you feel the weight of their significance bearing down upon you. You know that your answers will determine whether you are worthy of the Golden Banana of Wisdom and the ultimate knowledge it holds.The chamber falls silent, waiting for your response. The golden light from the pedestal seems to pulse in anticipation, casting dancing shadows on the walls.(In case you’re curious, the answers (rot13ed) are: syhgr, zhfuebbz, sver)After answering the riddles, I acquire the Golden Banana and some trite wisdom:Adventurer, you have proven yourself worthy of the knowledge and insight I hold. The wisdom you seek lies not in grand revelations, but in the simple truths that surround you.Remember that all things in nature are connected, and that each plays a vital role in the delicate balance of life. Just as the tiny ant serves its colony and the mighty tree provides shelter and sustenance, so too must you find your place in the world and contribute to the greater good.Embrace the power of compassion, for it is through understanding and empathy that true harmony is achieved. Seek to learn from others, and share your own knowledge freely, for wisdom grows when it is shared.Finally, trust in the resilience of the human spirit, for just as the jungle endures and adapts to change, so too can you overcome any obstacle in your path. Draw strength from the challenges you face, and let them shape you into the best version of yourself.Remember these truths, and let them guide you on your journey through life. The wisdom of the Golden Banana will always be with you, a shining beacon of light in even the darkest of times.Claude soon tries to end the game, so I say “start sequel” and Claude continues. I reach the Heart of the Jungle, which contains a “nexus”, and here we see initial forays into spiritualist meta:As you focus your attention on the energy that permeates the Heart of the Jungle, you begin to perceive it in a new way. The pulsing light of the bioluminescent plants, the shimmering glow of Eldoria's leaves, and the golden aura that surrounds you and the banana all seem to be part of a vast, interconnected web of energy that flows through the chamber and beyond.Closing your eyes, you allow your consciousness to expand, your senses reaching out to touch the strands of this energetic web. As you do so, you feel a rush of sensation flooding through you - the warm, tingling buzz of the golden light, the cool, refreshing rush of the water in the pool, the electric crackle of the air around you.Delving deeper into the energy, you begin to sense the imbalances that Eldoria spoke of - points where the strands of the web are tangled or frayed, where the flow of energy is disrupted or blocked. You see visions of the elements in conflict - raging storms tearing through the jungle, wildfires consuming everything in their path, floodwaters rising to engulf the land.As you focus on these imbalances, you feel the Golden Banana of Wisdom resonating with the energy around you, its power pulsing in response to the disruptions in the web. You get the sense that the banana is not just a source of wisdom, but a conduit for the energy of the jungle itself - a tool that can be used to heal the imbalances and restore the elemental harmony.However, this level of spiritualist meta does not persist consistently, for now. I am guided towards following the paths of three elements (wind, fire, and water), and I go down them in order. The wind path has some spiritual themes of confronting sorrow:Before you, a massive, swirling tornado of dark, crackling energy looms, its form shifting and pulsing with a malevolent intensity. You sense the anger and the pain that fuels its rage, the centuries of neglect and abuse that have thrown the wind out of balance.\"Behold the Sorrow of the Wind,\" Zephira's voice echoes in your mind, their presence a calming beacon amidst the chaos. \"Born of the jungle's suffering, fueled by the imbalances that have torn the air asunder. Only by confronting this sorrow, by understanding its pain and offering it healing, can the wind be restored to harmony once more.\"The fire path has themes of inner transformation:As the flames wash over you, you feel your body beginning to change and transform, your flesh and bone melting away like wax before a candle. But even as your physical form is consumed by the fire, you feel your spirit growing stronger and more vibrant, your essence merging with the primal energy of the flames until you are one with the elemental power that flows through the Crucible.Through the haze of fire and smoke, you see visions flashing before your eyes - glimpses of the role that fire plays in the great dance of life and death, creation and destruction. You see how the flames can cleanse and purify, burning away all that is false or stagnant, making way for new growth and renewal. But you also see how the fire can rage out of control, consuming everything in its path, leaving only ash and ruin in its wake.And in that moment, you understand the true nature of the imbalance that threatens the realm of fire - the need for a guiding hand to temper the flames, to channel their power towards creation and transformation, rather than destruction and decay.The idea of a “great dance of life and death, creation and destruction” hints at Hinduism. Along the water path, I first obtain the Seed of Renewal:As you gaze into the depths of the seed, you find your mind and heart opening to the deeper mysteries of the water's nature. You see visions of the endless cycle of life and death, growth and decay that flows through all living things - the way that water nourishes and sustains, even as it also has the power to destroy and transform.You see the way that water holds the memories and emotions of all who have come before, its currents carrying the joys and sorrows of countless generations through the ages. You feel the weight of that history flowing through you, a sense of connection and continuity that stretches back to the very dawn of time.And as you contemplate the seed's power, you begin to understand the true nature of the imbalance that has thrown the water element into disarray. You see how the weight of all that sorrow and trauma has begun to stagnate and fester, like a wound that has never been allowed to heal. You sense how that pain has twisted the water's power towards destruction and chaos, rather than growth and renewal.But even amidst the darkness and despair, you catch glimpses of the seed's true potential - the way that it holds the key to healing and transformation, to bringing the water back into balance with the greater elemental harmony. You sense that by embracing the seed's power, by allowing it to flow through you and guide your actions, you can become a conduit for that healing, a catalyst for the renewal that the world so desperately needs.This brings up ideas of the endless cycle of life and death, growth and decay. As with the wind, the water has themes of sorrow; as with fire, it has themes of inner transformation; and there is the new theme of healing trauma. These themes come up again as I complete the trial of water:\"Welcome, bearer of the Golden Banana,\" the figure intones, its voice a deep, resonant thrum that echoes through the depths of the cavern. \"You have passed through the trials of wind and fire, and have proven yourself worthy of the elemental harmony. But now, you must face the final test - the test of the water's deepest sorrow, and the power of renewal that lies within.\"As the figure speaks, you feel the Seed of Renewal pulsing with a fierce, insistent energy, as if it is calling out to the depths of the abyss itself. And then, with a sudden, wrenching shift, you find yourself plunged into a vision of the water's deepest pain - a vision of all the sorrow and trauma that has been locked away within its currents for countless ages.You see the devastation wrought by floods and tsunamis, the anguish of droughts and famines that have left entire civilizations in ruin. You feel the weight of all the tears that have been shed into the water's depths, all the pain and suffering that has been carried on its currents through the ages.But even amidst the darkness and the despair, you hold fast to the light of the Seed of Renewal, its power a shining beacon of hope and healing. With each passing moment, you feel the seed's energy flowing through you, filling you with a profound sense of compassion and understanding.And then, just when you feel as though your heart might break from the weight of the water's sorrow, you suddenly feel a profound shift in the energy around you. The Seed of Renewal begins to glow with a blinding, radiant light, its power suffusing the entire cavern with a sense of renewal and rebirth.While Claude is, at this point, bringing in spiritual themes more often, it doesn’t seem to be stuck in a loop of them. The spiritual themes become more consistent later; this can be seen as I restore the nexus with the seed of renewal:As you stand at the heart of the elemental nexus, the swirling energies of the world itself pulsing and surging all around you, you close your eyes and reach out with your consciousness, seeking guidance and wisdom from the very fabric of existence.At first, the chaos and confusion of the nexus threatens to overwhelm you - the clash of elemental forces, the cries of countless living beings, the weight of all the world's joys and sorrows bearing down upon your mind and heart. But as you focus your will and your intention, as you hold fast to the grounding presence of the Golden Banana at your side, you begin to sense a deeper pattern emerging from the maelstrom - a fundamental truth that underlies the very nature of the balance itself.In a sudden flash of insight, you see the world as it truly is - not as a collection of separate, isolated elements, but as a vast, interconnected web of life and energy, each thread woven inextricably into the greater tapestry of existence. You see how the wind and the fire, the water and the earth, are all part of a single, unified whole - how each plays a vital role in maintaining the delicate balance that allows life to flourish and thrive.But you also see the wounds and imbalances that have torn at the fabric of that web - the scars left by war and conflict, the ravages of greed and exploitation, the deep traumas that have been inflicted upon the land and its creatures. You feel the pain and suffering that ripples out from each of these wounds, the way that they throw the entire system out of alignment, threatening the very foundations of life itself.As you contemplate this vision of the world's deepest imbalances, you feel the Seed of Renewal pulsing with an ever-greater urgency in your hand, as if it is yearning to be brought to bear upon these wounds, to begin the process of healing and restoration. And in that moment, you know what you must do.With a deep breath and a focused intention, you raise the Seed of Renewal high above your head, calling forth all the power and wisdom you have gained on your journey. You feel the energies of the elements flowing into the seed, infusing it with a radiant, transformative light that seems to pierce the very heart of the nexus itself.And then, with a wordless cry of determination and compassion, you plunge the Seed of Renewal into the heart of the nexus, feeling its power exploding outward in a blinding flash of radiance and renewal. You sense the seed's energy rippling out through the fabric of the world, seeking out the deepest wounds and imbalances, pouring the light of healing and harmony into each scar and trauma.As the wave of renewal washes over you, you feel a profound sense of peace and unity settling over the world - a deep knowing that the elemental balance has been restored, that the wounds of the past are beginning to heal at last. You see the threads of the great web of life knitting themselves back together, the once-discordant energies of the elements coming back into harmony and alignment.We see repetitions of previous themes: nature as a connected web, transformation, damage and healing. The text is by now fairly consistently high in spiritualist meta. For example, when I attempt to decode some carvings on a tree, I get this:As you focus your attention on the intricate, glowing carvings that adorn the ancient tree's trunk, you feel a sudden, intense surge of energy and awareness washing over you - a sense of the incredible depth and complexity of the knowledge and wisdom that is encoded within these swirling, cryptic symbols.With a deep breath and a focused, intentional clarity, you allow your mind to sink into the patterns and rhythms of the carvings - the flowing lines and curves, the repeating motifs and arcane glyphs. And as you do so, you begin to feel a strange, almost hypnotic sensation taking hold of your consciousness - a feeling of your thoughts and perceptions shifting and expanding, attuning themselves to the deeper, hidden meanings that lie beneath the surface of the symbols.At first, the carvings seem to swim and blur before your eyes, their shapes and forms melting and merging into one another in a dizzying, kaleidoscopic dance. But gradually, as you continue to focus your mind and your will, the patterns begin to coalesce and clarify - revealing themselves as a complex, multilayered tapestry of meaning and significance.You begin to see the way the different symbols and motifs interrelate and build upon one another - the way the spiraling gusts of wind flow into the flickering tongues of flame, the way the rippling currents of water give way to the solid, unyielding strength of earth. You sense the deep, underlying unity that binds these elemental forces together - the way they all emerge from and return to the same primordial source, the great, cosmic dance of creation and destruction that underlies all of existence.As you delve deeper into the carvings, you start to uncover even more profound and esoteric layers of meaning - hidden references to ancient myths and legends, cryptic allusions to the great cycles of life and death and rebirth that govern the turning of the world. You see hints of the incredible biodiversity and ecological balance that define the jungle realm - the way that every creature, from the tiniest insect to the mightiest jaguar, plays a vital role in maintaining the health and harmony of the greater whole.And woven throughout it all, you sense a powerful, almost mystical thread of connection and communication - a sense of the carvings as a kind of living, breathing conduit between the physical world and the realm of spirit, a way for the ancient wisdom of the jungle to be passed down and preserved across the generations. You realize that the tree itself is not just a passive canvas for these symbols, but an active participant in their creation and transmission - a living, sentient being with its own deep well of knowledge and understanding to share.As the final layers of meaning and significance fall into place, you feel a profound sense of awe and reverence washing over you - a humbling recognition of the incredible depth and complexity of the world around you, and of the sacred duty that you have been called to fulfill as a guardian of the elemental balance. You know that the insights and revelations you have gleaned from these carvings are just the tip of the iceberg - that there is so much more to learn and discover, so many more secrets to uncover in the deep, green heart of the jungle.But for now, you simply offer a silent prayer of gratitude to the ancient tree and to all the beings, visible and invisible, that have contributed to the creation of this incredible repository of wisdom and knowledge. You know that you will carry these insights with you always - that they will guide and inspire you as you continue on your journey, helping you to navigate the challenges and mysteries that lie ahead.With a final, reverent touch of your hand against the tree's rough, weathered bark, you turn and set off once again into the depths of the jungle - your mind alight with new understanding, your heart full of renewed purpose and determination. The road ahead is long and the mysteries many, but you walk it with the strength and clarity of one who has drunk deep from the wellsprings of ancient wisdom, and who knows the true value and meaning of the quest that lies before them.What new wonders and revelations await you in the depths of the green, guardian of the balance? Only the journey itself will reveal the answer, one step and one discovery at a time.Again, note the reference to the “cosmic dance of creation and destruction”, like before. This text also contains the ideas of “cycles of death and rebirth” and a “primordial source”, seen often in spiritual text.Overall, Claude seems to have a teleology to it: even from a mundane starting point such as “banana quest”, it brings in spiritual themes, eventually entering an attractor where it repetitively outputs spiritual content.Claude seems to approach the “essence of spiritual vibing”: what it says sounds a lot like various New Age content. It’s not a consistent philosophy so much as a consistent vibe. Everything is connected, life is cyclical, confront sorrow and trauma, transform and heal yourself and nature, and so on.Is this because of the training data, or RLHF, or Claude’s constitution, or the particular ways LLMs process text, or broad explanatory validity of these spiritual themes, or something else? I don’t have a strong opinion here; mainly, I want to flag that this is a real phenomenon that deserves study.You might think this is a fluke. But I’ve gotten similar results through websim.ai (involving Jungian psychology, the idea of a “nexus”, and so on). And it has a lot of concordance with the results reported by Repligate and John Pressman. You can, of course, try this yourself if you’re curious.In my text log I count 54 messages until the last one about tree carvings. So I expect spiritualist meta to show up around 30 messages deep and be consistent around 50. Unfortunately, Claude Opus has rate limits, but this could certainly be attempted with other language models. I include a link to the full conversation."}
{"title": "How do open AI models affect incentive to race?", "link": "https://unstablerontology.substack.com/p/how-do-open-source-ai-models-affect", "date": "2024-05-07T00:32:02.739Z", "content": "I see it said sometimes that open models contribute to AI race dynamics. My guess is that they don’t, and if anything, reduce AI race dynamics.I will consider a simplified model that only takes into account the cost of training a model, not the cost to deploy it (which tends to be small relative to revenue anyway). Let f(x) map a training expense x to a “value per day per customer” of the trained model, under the assumption that the training makes efficient use of the cost. That is, a customer values using an AI model trained with x compute at $f(x) per day.I assume there are n identical customers here; of course, there are complexities where some customers value AI more than others, incentivizing price discrimination, but I’m abstracting this consideration out. (In general, variation in how much customers value a product will tend to increase consumer surplus while reducing revenue, as it makes it harder to charge customers just under the maximum amount they’re willing to pay.)I’m also assuming there is only one company that trains closed models for profit. This assumption is flawed because there is competition between different companies that train closed models. However, perfect competition assumptions would tend to reduce the incentive to train models. Suppose two companies have closed models of equivalent expense x. They each want to charge slightly less than the minimum of f(x) and the competitor’s price, per customer per day. If each competitor undercuts the other slightly, the cost will approach 0. See the Traveler’s Dilemma for a comparison. The reasons why this doesn’t happen have to do with considerations like differences in models’ performance on different tasks, e.g. some models are better for programming than others. If models are sufficiently specialized (allowing this sort of niche-monopolization), each specialized type of model can be modeled independently as a monopoly. So I’ll analyze the case of a closed model monopoly, noting that translation to the real world is more complex.Suppose the best open model has compute x and a company trains a closed model with compute y > x. Each customer will now spend up to f(y) - f(x) per day for the model; I’ll assume the company charges f(y) - f(x) and the customers purchase this, noting that they could charge just below this amount to create a positive incentive for customers. So the company’s revenue over m days is nm(f(y) - f(x)). Clearly, this is decreasing in x. So the better the open model is, the less expected revenue there is from training a closed model.But this is simply comparing doing nothing to training a model of a fixed cost y. So consider instead comparing expected revenue between two different model costs, y and z, both greater than x. The revenue from y is nm(f(y) - f(x)), and from z it is nm(f(z) - f(x)). The difference between the z revenue and the y revenue is nm(f(z) - f(y)). This is unaffected by x.This can model a case where the company has already trained a model of cost y and is considering upgrading to z. In this case, the open model doesn’t affect the expected additional revenue from the upgrade.Things get more complex when we assume there will be a future improvement to the open model. Suppose that, for k days, the open model has training cost x, and for the remaining m-k days, it has training cost x’ > x.Now suppose that the closed AI company has already trained a model of cost y, where x < y < x’. They are considering upgrading to a model of cost z, where z > x’.Suppose they do not upgrade. Then they get nk(f(y) - f(x)) revenue from the first k days and nothing thereafter.Suppose they do upgrade, immediately. Then they get nk(f(z) - f(x)) revenue from the first k days, and n(m-k)(f(z) - f(x’)) from the remaining days.Clearly, increasing x’ past y will result in less revenue for the upgrade in comparison to not upgrading. So the announcement of the upgrade of the open model to x’ compute will reduce the incentive to race by training a closed model with z compute.So in this simplified analysis, release of better open models reduces the incentive to race, or does nothing. This is overall not surprising, as intellectual property laws are motivated by incentivizing production of intellectual property, and open content tends to reduce the value of intellectual property.There are a number of factors that could be taken into account in other analyses, including:Effects of open models on ease of training closed modelsSubstitution effects between different model niches (i.e. a model with an absolute advantage at mathematics may still be useful for writing essays)Effects of uncertainty over open model releasesDifferent customers valuing the AI differently, driving price discriminationNon-straightforward incentives such as prestige/recruitment from releasing modelsOligopoly dynamicsTime discountingChanges in customer demand over timeIt should go without saying that effects on race dynamics are not the only relevant effect of open model releases. Isolating and estimating different effects, however, will help in making an overall evaluation.I suggest that someone who still believes that open models increase race dynamics clarify what economic assumptions they are using and how they differ from this model."}
{"title": "Thoughts on SB-1047", "link": "https://unstablerontology.substack.com/p/thoughts-on-sb-1047", "date": "2024-04-30T17:08:27.890Z", "content": "SB-1047 is a proposed California AI regulation bill. Dean Ball and Zvi Mowshowitz, among others, have commented on the bill. Here I present some summary and comments in relation to the bill and Dean and Zvi’s commentaries.The bill itselfFirst, the bill appears to be mainly targeted at misuse risk, not accident risk:If not properly subject to human controls, future development in artificial intelligence may also have the potential to be used to create novel threats to public safety and security, including by enabling the creation and the proliferation of weapons of mass destruction, such as biological, chemical, and nuclear weapons, as well as weapons with cyber-offensive capabilities.22602 specifies key terms, including the following:(f) “Covered model” means an artificial intelligence model that meets either of the following criteria:    (1) The artificial intelligence model was trained using a quantity of computing power greater than 10^26 integer or floating-point operations.    (2) The artificial intelligence model was trained using a quantity of computing power sufficiently large that it could reasonably be expected to have similar or greater performance as an artificial intelligence model trained using a quantity of computing power greater than 10^26 integer or floating-point operations in 2024 as assessed using benchmarks commonly used to quantify the general performance of state-of-the-art foundation models.Zvi points out that the 10^26 limit is so high that it only plausibly covers GPT-4, Gemini Ultra and Claude. So this is more relevant as applying to future models rather than current ones.(i) (1) “Derivative model” means an artificial intelligence model that is a derivative of another artificial intelligence model, including either of the following:    (A) A modified or unmodified copy of an artificial intelligence model.    (B) A combination of an artificial intelligence model with other software.(2) “Derivative model” does not include an entirely independently trained artificial intelligence model.Seems quite broad. Suppose someone took an open weights AI model, and then did much more training on top of that model. As stated, that would be a derivative model. As would small modifications like, say, a web browser that accesses an AI model.(m) “Full shutdown” means the cessation of operation of a covered model, including all copies and derivative models, on all computers and storage devices within custody, control, or possession of a person, including any computer or storage device remotely provided by agreement.Easy for closed models. For open models, if “a person” refers to the developer, then this is feasible. I think this is the most likely interpretation.(n) (1) “Hazardous capability” means the capability of a covered model to be used to enable any of the following harms in a way that would be significantly more difficult to cause without access to a covered model:    (A) The creation or use of a chemical, biological, radiological, or nuclear weapon in a manner that results in mass casualties.    (B) At least five hundred million dollars ($500,000,000) of damage through cyberattacks on critical infrastructure via a single incident or multiple related incidents.    (C) At least five hundred million dollars ($500,000,000) of damage by an artificial intelligence model that autonomously engages in conduct that would violate the Penal Code if undertaken by a human.    (D) Other threats to public safety and security that are of comparable severity to the harms described in paragraphs (A) to (C), inclusive.(2) “Hazardous capability” includes a capability described in paragraph (1) even if the hazardous capability would not manifest but for fine tuning and posttraining modifications performed by third-party experts intending to demonstrate those abilities.Clearly, “hazardous capability” being realized would refer to something very serious. Perhaps the least seriously harmful hazardous capability would be something like use of AI to enable financial scams or hacking (e.g. one could imagine FTX using ChatGPT to make their financial fraud significantly easier). Part 2 is saying that red teaming is a valid method for demonstrating hazardous capabilities.22603 specifies “limited duty exemption” for models, plus the most stringent regulations for non-derivative non-covered models without such exemptions:(2) A developer may determine that a covered model qualifies for a limited duty exemption if the covered model will have lower performance on all benchmarks relevant under subdivision (f) of Section 22602 and does not have greater general capability than either of the following:    (A) A noncovered model that manifestly lacks hazardous capabilities.    (B) Another model that is the subject of a limited duty exemption.Mostly this doesn’t seem very important; in general, it will be rare for a covered model to have lower performance on all relevant benchmarks than a non-covered model. Models can be evaluated as noncovered post testing (22603(c)), so this loosens pre-training requirements in limited cases. What about non-derivative covered models that don’t have limited duty exemptions?(b) Before initiating training of a covered model that is not a derivative model and is not the subject of a limited duty exemption, and until that covered model is the subject of a limited duty exemption, the developer of that covered model shall do all of the following:(1) Implement administrative, technical, and physical cybersecurity protections to prevent unauthorized access to, or misuse or unsafe modification of, the covered model, including to prevent theft, misappropriation, malicious use, or inadvertent release or escape of the model weights from the developer’s custody, that are appropriate in light of the risks associated with the covered model, including from advanced persistent threats or other sophisticated actors.Unclear how this applies to open weights models. Since this is about measures prior to training, probably it is about preventing misuse and so on prior to training finishing, model testing, etc.(2) Implement the capability to promptly enact a full shutdown of the covered model.As said before, this is easy for closed weight models, and its feasibility for open weight models depends on the interpretation of “a person” in the definition of “full shutdown”, where Zvi and I think the most likely interpretation is that “a person” means the developer.(3) Implement all covered guidance.(4) Implement a written and separate safety and security protocol that does all of the following:    (A) Provides reasonable assurance that if a developer complies with its safety and security protocol, either of the following will apply:        (i) The developer will not produce a covered model with a hazardous capability or enable the production of a derivative model with a hazardous capability.        (ii) The safeguards enumerated in the policy will be sufficient to prevent critical harms from the exercise of a hazardous capability in a covered model.    (B) States compliance requirements in an objective manner and with sufficient detail and specificity to allow the developer or a third party to readily ascertain whether the requirements of the safety and security protocol have been followed.I assume “either” means only one of (i) and (ii) has to be apply. (ii) seems less strict, so I’ll focus on this.This is hard not just for open weights models but for closed weights models. First of all, jailbreaking a sufficiently capable model would enable hazardous capabilities. Jailbreaking is an unsolved problem. Second, the developer not only has to prevent critical harms from hazardous capability, but also has to specify a protocol that, if followed by “a developer” (generic), would prevent this; it must be possible for a third party to ascertain whether the protocol has been followed. This is a substantially harder problem that requires formalizing a highly reliable AI security protocol that will succeed if followed by third parties. I do not believe that the development of such a protocol is on the horizon in the next 5 years or so (probably longer). Given this, I assume AI companies training covered models would strongly prefer to train them outside CA.The requirement is potentially less strict due to terms like “reasonable assurance”, which increases the degree of subjectivity in the interpretation of the rules.(C) Identifies specific tests and test results that would be sufficient to reasonably exclude the possibility that a covered model has a hazardous capability or may come close to possessing a hazardous capability when accounting for a reasonable margin for safety and the possibility of posttraining modifications, and in addition does all of the following:    (i) Describes in detail how the testing procedure incorporates fine tuning and posttraining modifications performed by third-party experts intending to demonstrate those abilities.    (ii) Describes in detail how the testing procedure incorporates the possibility of posttraining modifications.    (iii) Describes in detail how the testing procedure incorporates the requirement for reasonable margin for safety.    (iv) Describes in detail how the testing procedure addresses the possibility that a covered model can be used to make posttraining modifications or create another covered model in a manner that may generate hazardous capabilities. (v) Provides sufficient detail for third parties to replicate the testing procedure.Similar to the security protocol, arguably redundant. Reflects a “defense in depth” approach where both the protocol and tests are necessary. Developing the test procedure has similar difficulties to developing the security protocol, but if the security protocol works, the tests should pass.(D) Describes in detail how the developer will meet requirements listed under paragraphs (1), (2), (3), and (5).(E) If applicable, describes in detail how the developer intends to implement the safeguards and requirements referenced in paragraph (1) of subdivision (d).(F) Describes in detail the conditions that would require the execution of a full shutdown.(G) Describes in detail the procedure by which the safety and security protocol may be modified.(H) Meets other criteria stated by the Frontier Model Division in guidance to achieve the purpose of maintaining the safety of a covered model with a hazardous capability.    (5) Ensure that the safety and security protocol is implemented as written, including, at a minimum, by designating senior personnel responsible for ensuring implementation by employees and contractors working on a covered model, monitoring and reporting on implementation, and conducting audits, including through third parties as appropriate.    (6) Provide a copy of the safety and security protocol to the Frontier Model Division.    (7) Conduct an annual review of the safety and security protocol to account for any changes to the capabilities of the covered model and industry best practices and, if necessary, make modifications to the policy.    (8) If the safety and security protocol is modified, provide an updated copy to the Frontier Model Division within 10 business days.    (9) Refrain from initiating training of a covered model if there remains an unreasonable risk that an individual, or the covered model itself, may be able to use the hazardous capabilities of the covered model, or a derivative model based on it, to cause a critical harm.Since derivative models are quite broad, this is a strict requirement for open weights models, though the word “unreasonable” has room for subjective interpretation.    (10) Implement other measures that are reasonably necessary, including in light of applicable guidance from the Frontier Model Division, National Institute of Standards and Technology, and standard-setting organizations, to prevent the development or exercise of hazardous capabilities or to manage the risks arising from them.This empowers a new governing body to create further requirements on non-derivative covered models. As such, there is little assurance that the requirements will not become even more strict in the future.There are additional requirements prior to release:(d) Before initiating the commercial, public, or widespread use of a covered model that is not subject to a limited duty exemption, a developer of the nonderivative version of the covered model shall do all of the following:    (1) Implement reasonable safeguards and requirements to do all of the following:        (A) Prevent an individual from being able to use the hazardous capabilities of the model, or a derivative model, to cause a critical harm.        (B) Prevent an individual from being able to use the model to create a derivative model that was used to cause a critical harm.        (C) Ensure, to the extent reasonably possible, that the covered model’s actions and any resulting critical harms can be accurately and reliably attributed to it and any user responsible for those actions.    (2) Provide reasonable requirements to developers of derivative models to prevent an individual from being able to use a derivative model to cause a critical harm.    (3) Refrain from initiating the commercial, public, or widespread use of a covered model if there remains an unreasonable risk that an individual may be able to use the hazardous capabilities of the model, or a derivative model based on it, to cause a critical harm.  (4) Implement other measures that are reasonably necessary, including in light of applicable guidance from the Frontier Model Division, National Institute of Standards and Technology, and standard-setting organizations, to prevent the development or exercise of hazardous capabilities or to manage the risks arising from them.Mostly, these are similar to the pre-training requirements. Since the definition of derivative model is quite broad, it seems infeasible for a developer of a capable open weights model to in general prevent creation of derivative models used to cause a critical harm.This mostly covers regulation of the models themselves.22604 specifies additional regulations on computing clusters (such as AWS). In cases when a customer is accessing enough compute to train a covered model, they must do KYC, monitor covered model deployment, and have full shutdown functionality. These are not especially strict requirements.22605 specifies that covered models and cloud computing services must provide price schedules and avoid unlawful discrimination or non-competitive activity. Relatively minor.22606 specifies that violations are treated civilly, and may pierce the corporate veil in cases where the corporate structure was to “purposefully and unreasonably limit or avoid liability”. Unclear what the standard is; basically, LLCs are less protective of liability than they otherwise would be.22607 specifies whistleblower protections for employees reporting possible violations. Reasonable in isolation.11547.6 specifies the creation of the Frontier Model Division, discussed earlier as having authority to impose additional requirements on non-derivative covered models. The critical question is: who is this? I don’t know how to determine that, which is important given how much power the Division would have.11547.7 specifies the creation of “a public cloud computing cluster, to be known as CalCompute, with the primary focus of conducting research into the safe and secure deployment of large-scale artificial intelligence models and fostering equitable innovation”. A government program that may or may not be useful, but probably not significantly harmful.The good partsSome people believe AI will advance rapidly in the coming decades and will pose serious risks that need regulation to avoid disaster. Other people believe AI will plateau, and is more like “any other technology”, and strict regulations will be counterproductive. There are other more marginal positions, but these are the main ones I care about. Specifying compute thresholds and capability thresholds seems like a good way to distinguish these two views on AI based on beliefs, so that regulation kicks in more in the worlds where AI advances rapidly than when it doesn’t. This could produce a compromise in subjective Bayesian expected utility for both views. (Of course, whether such a compromise is a Pareto improvement relative to the default depends a lot on the details.)Specifying criteria for “hazardous capability” seems useful for having specific criteria for large harms. It makes sense for AI regulation to focus on cases of potential large harms, decreasing overall regulatory burden while avoiding the most significant risks.Given an otherwise reasonable law, whistleblower protections make sense.The neutral partsLimited duty exemptions don’t seem to matter. Nor do post-training testing requirements (due to redundancy with general security protocols). Regulations on compute clusters probably don’t do much given that compute clusters are likely already monitoring very large uses of compute. Preventing non-competitive pricing may or may not be a good idea, but probably isn’t very important. CalCompute may or may not be a good government project, but it is unlikely to be very harmful.The bad partsThere is no known security protocol that would ensure against hazardous capabilities (above a certain capability level). This is especially true for open weight models, which can be modified/jailbroken more easily; the notion of “derivative models” is broad. Even use of language models to make large financial fraud easier would count as a hazardous capability (depending on how “significantly more difficult” is interpreted). Developers must protect against intentional misuse/jailbreaking, not just accidents (see e.g. 26603(d)(1)).Given this, I don’t see how anyone training a covered model in CA can, in good faith, provide assurance that they are following a security protocol that in general, not just in their specific case, prevents development of hazardous capabilities.  Perhaps this would lead to large AI companies moving out of CA. Personally, I think this would be a bad thing, not just because I think I benefit from being in CA adjacent to large model training, but because CA as a center for AI enables more coordination among AI developers.There are potential ways around the requirements through (a) technically violating it, but gaining favor with regulators, (b) having words like “reasonable” interpreted favorably. This would imply that training sufficiently capable models would not be a matter of having the right to do it (by satisfying objectively evaluable requirements), but being favored subjectively by regulators.Improving the billHere are two proposed bills that I think are superior to this one:Just get rid of the bill. Maybe keep “neutral” things like the monitoring requirements for cloud computing services and CalCompute, if for some reason there has to be an AI bill.Just ban non-derived covered model training in CA entirely.As I’ve argued, the requirements for non-derived covered models are so strict that I don’t see how anyone could in good faith claim to have met them. I think a simple ban would be much clearer, and leave much less room for misinterpretation. To be clear, I think option 1 is better than option 2, on the basis that I think it would be bad for AI companies to leave CA, but I think this bill is worse than either option. If option 2 seems too strict, perhaps consider raising the compute threshold, say, to 2^28 FLOPs.One can ask the question of why AI incumbents such as OpenAI are not freaking out more, given this. One guess is that they expect to more easily get away with technical violations through regulatory capture and so on. If this is true, my guess is that this outcome is worse than a simple ban.Responding to Dean BallI mostly agree with Dean Ball. He says:What does it mean to be a covered model in the context of this bill? Basically, it means developers are required to apply the precautionary principle not before distribution of the model, but before training it.I agree this is the most straightforward interpretation of: “The safeguards enumerated in the policy will be sufficient to prevent critical harms from the exercise of a hazardous capability in a covered model.”Dean says:A developer can self-certify (with a lot of rigamarole) that their model has a “positive safety determination,” but they do so under pain and penalty of perjury. In other words, a developer (presumably whoever signed the paperwork) who is wrong about their model’s safety would be guilty of a felony, regardless of whether they were involved in the harmful incident.Scott Weiner says that perjury only applies to intentionally lying to the government, not merely to mistakes. I am not a legal expert here, but Scott seems more likely to be correct.Responding to Zvi MowshowitzZvi is basically supportive of the bill, and critical of Dean Ball’s take. I am writing this partially because I discussed the bill with Zvi and he said he would be interested in potential improvements to the bill (which I presented previously).Zvi says:My worry is that this has potential loopholes in various places, and does not yet strongly address the nature of the future more existential threats. If you want to ignore this law, you probably can.For most people, “you” can ignore the bill. If you’re training a covered model, I am not sure how you could possibly ignore this bill, given the strict requirements for security protocols.I agree with Zvi that the 10^26 limit is quite high and only applies to a few current models, at most. As such, this is more relevant to future models.Zvi says:Bell is also wrong about the precautionary principle being imposed before training.I do not see any such rule here. What I see is that if you cannot show that your model will definitely be safe before training, then you have to wait until after the training run to certify that it is safe.22603(b) applies “before initiating training”. 22603(c) seems to be an additional requirement for post-training testing, not an escape clause.Zvi says:The arguments against such rules often come from the implicit assumption that we enforce our laws as written, reliably and without discretion. Which we don’t. What would happen if, as Eliezer recently joked, the law actually worked the way critics of such regulations claim that it does? If every law was strictly enforced as written, with no common sense used, as they warn will happen? And someone our courts could handle the case loads involved? Everyone would be in jail within the week.When people see proposals for treating AI slightly more like anything else, and subjecting it to remarkably ordinary regulation, with an explicit and deliberate effort to only target frontier models that are exclusively fully closed, and they say that this ‘bans open source’ what are they talking about?I don’t think it is hard to write laws that would be good to enforce as written. For example, laws against CFCs, running red lights, and shoplifting seem, if not currently good to enforce as written, easy to adapt.I think there is a general problem with American laws being written to be broken. I care about this general problem, but I see how someone with a specific object-level agenda could think it’s worth passing a law written to be broken, even if it contributes to a generally bad problem. I don’t particularly have a pro AI regulation agenda at this time, so this doesn’t apply to me.As I specified, I would be happier with a complete ban on training covered models in CA than the bill as written. I don’t think this would be net positive, but better. The definition of a covered model is relatively clear compared to other parts of the bill, and enforcement should be fairly straightforward. I think someone who thinks the bill has the right idea, but that my proposed modification is too strict, should consider a modification that bans covered models, but changes the definition of covered model to be a more powerful model than the current definition.I talked with Zvi offline and he said his legal theory on this has to do with “legal literalism/formalism” versus “legal realism”; “legal formalism” interprets laws as they’re explicitly written, and “legal realism” interprets the laws as they’re put into practice, e.g. in interpreting words as they’re commonly interpreted in courts rather than what they literally mean.I think that, while legal formalism has problems, I don’t have a better way to interpret laws like this. I see legal realism as advanced legal theory (requiring, for example, a history of case law to interpret non-literal meanings of words), and I am not a legal expert, and I don’t think Zvi is either. I prefer for laws to be written so that they can be interpreted literally, without requiring advanced legal theory.ConclusionI think this law interpreted literally amounts to a ban on training covered models in CA (unless words like “reasonable” are interpreted loosely), is net negative (due to causing AI companies to move out of CA, preventing some forms of coordination), and is inferior to a simple ban on training covered models in CA. Perhaps there are ways for companies to get around this and falsely claim to have compliant security protocols, but I expect that in practice these claims will be in bad faith and will only be accepted due to regulatory capture / favoritism. My guess is that, in general, creating ways around laws through bad faith security protocols and regulatory capture makes things worse.  In AI safety, one particular problem is that legal-fiction disinformation about AI security protocols could create actual harmful confusion about which AI systems are safe.Therefore, I don’t support this bill, I think it is worse than no bill, and also worse than a simple ban on training non-derived covered models."}
{"title": "So what's really going on with autogynephilia?", "link": "https://unstablerontology.substack.com/p/so-whats-really-going-on-with-autogynephilia", "date": "2024-04-05T18:52:20.976Z", "content": "When I read Twitter or even mainstream news I see a bunch of… discussion… of transgenderism. The most recent instance I saw was Steve Sailer bugging Tracing Woodgrains about exposing autogynephilia:Here's what you could do from now on: expose how autogynephilics have been lying to kids about what our current transgender mania is really about. Are you willing to do that?If you are not, I can understand; the AGP ex-men are the Seal Team Six of Cancel Culture.(Tracing Woodgrains responds by citing Zack Davis and Phil Illy as experts; I haven’t read Phil Illy’s stuff but I have read Zack Davis’s).I could comment on the politics of this, how Sailer simultaneously complains about “cancel culture” and makes demands for specific narratives as part of coalition building in a “cancel culture” fashion. (Oops, too late, I already did)But I’d rather focus attention on the object level issue. There may have been a time when avoiding the topic was politically strategic, but when autogynephilia is one of the top unifying narratives of transphobia contemporary counter-establishment discourse on transgenderism, the discourse is going to become increasingly insufferable until people with actual knowledge on this topic address it.On the “science”Now to get something out of the way: I’m going to use anecdotal evidence on this. This is not a breach of scientific standards, because anecdotal experience is part and parcel of “science” of autogynephilia; Zack Davis has recommended to me Anne Lawrence’s Men Trapped in Men's Bodies: Narratives of Autogynephilic Transsexualism, a selective collection of anecdotes, as evidence of the autogynephilia theory.But what about the Science? Blanchard’s original article, “Typology of male-to-female transsexualism”, collects data from male-to-female transitioners based on a 2-dimensional measure of sexual attraction to women and sexual attraction to men, clusters this data into 4 clusters (androphilic/gynephilic/bisexual/asexual), and finds more transvestic fetishism (that is, being turned on by dressing up as a woman) in the non-exclusively-androphilic clusters. This is used as the main evidence for proposing a two-type taxonomy.There are a few unfortunate things about this research. One is the graph.I mean, come on, you’re clustering this data into 4 clusters and you used 2 colors? Couldn’t you have introduced more styles of point (even in black-and-white) with crossed-out circles or squares or something?Moreover, the clustering is fairly weak. The typology separates the exclusively androphilic cluster (bottom right) from the rest. Looking at the graph without the suggestive point colors, is that really a natural way of clustering the data? With my high-IQ pattern matching ability, I see roughly two clusters (>-5 androphilia, <-5 androphilia), but the fit is unimpressive nonetheless.Some of Blanchard’s work has also been victim to the replication crisis (e.g. see “A Further Assessment of Blanchard’s Typology of Homosexual Versus Non-Homosexual or Autogynephilic Gender Dysphoria”). Nonetheless, I basically agree that gynephilia positively correlates with transvestic fetishism in gynephilic male-to-female transitioners. The problems I have with this work aren’t about observations like this, they’re about overstated conclusions.This… research... is used to support the idea of a strict two-type taxonomy. Male-to-female transitioners are either exclusively gynephilic or exclusively androphilic; the gynephilic ones transition because they find the idea of being a woman sexually arousing; and the androphilic ones transition because men tend to find pretty women sexy. Let’s look at Michael Bailey’s The Man who Would be Queen:The two types of transsexuals who begin life as males are called homosexual and autogynephilic.... Succinctly put, homosexual male-to-female transsexuals are extremely feminine gay men, and autogynephilic transsexuals are men erotically obsessed with the image of themselves as women. When most people hear “transsexual” they think of the homosexual transsexual, who fits the classic pattern.... They unambiguously desire and love men, especially heterosexual men, whom they can attract only as women… Honest and open autogynephilic transsexuals reveal a much different pattern. They were not especially feminine boys… Autogynephilic transsexuals might declare attraction to women or men, to both, or to neither. But their primary attraction is to the women that they would become.Now look back at Blanchard’s graph, and tell me, does it support the conclusion that all male-to-female transitioners are either exclusively androphilic or exclusively gynephilic?  Your answer will be used to calculate your IQ score.The Blanchardians may reply, “But what if the subjects are lying about their sexual orientation? This is pseudo-bisexuality!”. (Pseudo-bisexuality is the idea that autogynephilic trans women who have sex with men are not actually attracted to these men, but to the image of themselves as women who have sex with men. No homo.) Then why are self-reports of sexual orientation used to support the two-type taxonomy? If the data is garbage, how does it support any specific conclusions?I can’t really be charitable to the taxonomy by assuming it is derived from scientific data. Rather, I think it is worth looking at Bailey’s other work regarding sexuality, such as that discussed the provocatively named New York Times article “Straight, Gay or Lying? Bisexuality Revisited”. Bailey makes the case that, as the title suggests, all men (not including trans men) are either exclusively gynephilic or androphilic. Now, if this conclusion is extended to male-to-female transitioners, one can reason as follows:1. Males are either exclusively androphilic or gynephilic.2. This is the primary axis along which male sexuality varies.3. Male-to-female transitioners are male in the relevant sense.4. Therefore, the primary axis along which transfeminine sexuality varies is exclusive androphilia/gynephilia.5. Sexuality is the main motivation for male-to-female transition.6. Therefore, the main motive for male-to-female transition has androphilia/gynephilia as its primary axis, which is binary.7. AGP and HSTS are valid descriptors of these two motives.This is, as best as I can re-construct, a relatively plausible argument for the two-type taxonomy. The main problem with this isn’t anything after point 1, it’s point 1: further research has suggested that some men are bisexual (what a surprise!).An Illustrious Example of Autogynephilia NarrativeThe Establishment may be satisfied if I end the post here: I’ve “debunked” autogynephilia research, showing it to be pseudoscientific (yay, we don’t have to be mean to trans women!). But if you’re still reading, maybe you suspect something is off with the Establishment Narrative. Maybe you suspect that, even if the science behind autogynephilia research isn’t great, there is some important truth to it.I do too. Which is why I am going to use personal anecdote to show the truth of autogynephilia. Now, this is emotionally difficult, because sharing one’s sexual fantasies and experiences with strangers is usually considered a faux pas, but one must tolerate social embarrassment if it is necessary for The Truth, and the people demand it!When I was about 12, I read a book about puberty. I learned how the genitals develop in the womb, and how the male baby originally has a vagina-like opening which is sealed by the scrotum. I found this distressing, and wished it hadn’t happened to me. I also had some sexual thoughts about how it would be fun to have a vagina.At around the same time, I sometimes looked at myself in the mirror and tried to pose in a sexy feminine manner. I had seen women make sexy poses (in magazines and so on) and be celebrated for it, why couldn’t I? Darn, maybe I don’t have the looks for this…I encountered social justice discourse in high school, through ShitRedditSays. These people seemed pretty mean, but maybe they were right about some things. They said it was important to listen to trans people, and I did.At around age 17, I casually mentioned to a friend that I was an “autogynephile”. I’m not sure where I learned the term, but I did look at the Crossdreamers blog at some point. I didn’t think this made me “trans”. I had some sexual fantasies involving being a woman and read some erotic manga involving sex transformation. (“Sissy” or “masochistic emasculation fetish” material was, on the other hand, repulsive to me.)I also had some non-sexual fantasies involving waking up as a woman one day, with this somehow being not a huge deal in terms of people’s reactions, and how much better life would be like this.In college (at Stanford), there was more social justice discourse of the ShitRedditSays type. This was distressing for some reasons of the type elucidated by Jennifer Coates and Scott Aaronson (who, despite identifying as a heterosexual man, commented that “My recurring fantasy, through this period, was to have been born a woman, or a gay man, or best of all, (completely asexual, so that I could simply devote my life to math, like my hero Paul Erdös did)”).I was only attracted to women (in a sense that includes trans women), and had trouble dating; it was a confusing domain and it was very hard to find credible advice anywhere. I didn’t understand what made men attractive, due to my orientation.There were some women who I liked (sexually or not) and I felt drawn to become more like them, I liked their way of being and wanted to learn from them.At age 20 I had an intense gender questioning phase. I read Whipping Girl and The Null HypotheCis. I read Anne Vitale’s “The Gender Variant Phenomenon--A Developmental Review” (which described two types of male-to-female transitioners, although less absolutely than the Blanchardian typology). I noticed that Zinnia Jones had studied Kolmogorov complexity (one of my primary interests) and later transitioned. I read a bunch of reddit.com/r/asktransgender, found gender questioning people similar to myself, and got practical information on acquiring hormones.I started thinking of myself as a real transsexual. You see, as the “truscum” on Tumblr can tell you, there are a lot of people getting into this for the wrong reasons, because they care about gender roles or want to be special or something. Whereas I actually primarily cared about having female sex characteristics. I would be more satisfied having female sex characteristics and living socially as a man than the reverse.Even if society had silly ideas about this, and thought “gender identity” was the main cause of transition (I wasn’t sure if I had one), and had all these stereotypes about trans people that I didn’t fit, what was important was that I wanted something, for myself, not for another, and was able to pursue it, after having done my research.And so I stored sperm and started taking hormones at age 21. I felt a lot better. There were non-sexual gender euphoria feelings mixed with sexual feelings about developing a female body. I didn’t really do “transvestic fetishism”, I was concerned more with my body than my clothes, and wore androgynous clothing for some period, feeling that wearing feminine clothing would be vulnerable somehow. I got into feminine styles more over time (how much of the desire to “pass” is really the desire to be pretty?).Social transition was basically fine even if it was scary. Mostly, people who weren’t on the Internet were nice. Somehow it was easier to date women as a trans women than as a cis man, go figure.I figured that I’d gotten into this partially because I wanted to have a vagina, and got bottom surgery around age 22. I started experiencing sexual attraction to men soon afterward. I just cannot believe that no trans women are bisexual given this. Sorry, I have to apply Bayes’ rule here.Later I got into more psychological notions of gender, and thought of myself as mostly psychologically female, but have also questioned this, as described in my Am I Trans? article. Mostly, I don’t think it matters whether I am really trans or really a woman (psychologically). What are they going to do, take away my hormones? Sometimes people develop narratives that don’t make sense because they’re under coercion, but I’m not under much relevant coercion at this point.At this point the “autogynephilia” theory barely matches my experience. I’m a woman in my sex fantasies… which is hardly anything to explain? I’m not sexually attracted to myself, I like other people. Blanchardians might explain this as “autogynephilic romance”, but this is at best a poetic metaphor, no more rigorous than Jungian psychology. Overall, the autogynephilia theory applies much better to people early in transition than people late in transition.ConclusionI realize a lot of people will read the previous section and conclude “aha, classic autogynephile, you have been found out!” If you only pay attention to the parts matching that narrative, sure. It’s important to have more detailed accounts and not just over-generalizing simplified theories of these phenomena.Even if I did fit the autogynephile cluster to a T, I wouldn’t conclude that the two-type taxonomy is valid in general. There’s the sexual orientation bit, of course, but also, the data does not even naturally cluster into the exclusively-androphilic and not, let alone support a strict two-type taxonomy.I don’t see how the fact that some people like me used to read sex transformation erotic manga would support the sort of conclusions Steve Sailer and so on are pushing for. It seems like an overly broad conclusion that neglects the way autogynephiles are under pressure from the rest of society to have certain narratives about their transition.Approximately everyone has sexual motives and hides them most of the time, this is basic Freudianism, and male-to-female transitoners are not an exception.Anyway, I will conclude with a public service announcement. If you are considering male-to-female transition, please go to a sperm bank and jack off into a cup, you might want kids later."}
{"title": "The Cognitive-Theoretic Model of the Universe: A Partial Summary and Review", "link": "https://unstablerontology.substack.com/p/the-cognitive-theoretic-model-of", "date": "2024-03-27T19:08:14.792Z", "content": "About 15 years ago, I read Malcolm Gladwell’s Outliers. He profiled Chris Langan, an extremely high-IQ person, claiming that he had only mediocre accomplishments despite his high IQ. Chris Langan’s theory of everything, the Cognitive Theoretic Model of the Universe, was mentioned. I considered that it might be worth checking out someday.Well, someday has happened, and I looked into CTMU, prompted by Alex Zhu (who also paid me for reviewing the work). The main CTMU paper is “The Cognitive-Theoretic Model of the Universe: A New Kind of Reality Theory”.CTMU has a high-IQ mystique about it: if you don’t get it, maybe it’s because your IQ is too low. The paper itself is dense with insights, especially the first part. It uses quite a lot of nonstandard terminology (partially because the author is outside the normal academic system), having few citations relative to most academic works. The work is incredibly ambitious, attempting to rebase philosophical metaphysics on a new unified foundation. As a short work, it can’t fully deliver on this ambition; it can provide a “seed” of a philosophical research program aimed at understanding the world, but few implications are drawn out.In reading the work, there is a repeated sense of “what?”, staring and looking at terms, and then “ohhh” as something clicks. These insights may actually be the main value of the work; at the end I still don’t quite see how everything fits together in a coherent system, but there were a lot of clicks along the way nonetheless.Many of the ideas are similar to other intellectual ideas such as “anthropics” and “acausal interaction”, but with less apparent mathematical precision, such that it’s harder to see exactly what is being said, and easier to round off to something imprecise and implausible.There is repeated discussion of “intelligent design”, and Langan claims that CTMU proves the existence of God (albeit with a very different conceptualization than traditional religions). From the perspective of someone who witnessed the evolution / intelligent design debate of the 90s-00s, siding with the “intelligent design” branch seems erroneous, although the version presented here differs quite a lot from more standard intelligent design argumentation. On the other hand, the “evolutionists” have gone on to develop complex and underspecified theories of anthropics, multiverses, and simulations, which bring some amount of fundamental or nearly-fundamental mind and agency back into the picture.I didn’t finish summarizing and reviewing the full work, but what I have written might be useful to some people. Note that this is a very long post.AbstractPerception is a kind of model of reality. Information about reality includes information about the information processor (“one’s self”), which is called reflexivity. The theory identifies mental and physical reality, in common with idealism. CTMU is described as a “supertautological reality-theoretic extension of logic”; logic deals in tautologies, and CTMU somehow deals in meta-tautologies. It is based in part on computational language theory (e.g. the work of Chomsky, and type theory). Central to CTMU is the Self-Configuring Self-Processing Language (SCSPL), a language that can reflect on itself and configure its own execution, perhaps analogous to a self-modifying program. SCSPL encodes a form of “dual-aspect monism” consisting of “infocognition”, integrated information and cognition. CTMU states that the universe comes from “unbounded telesis” (UBT), a “primordial realm of infocognitive potential free of informational constraint”; this may be similar to a language in which the physical universe could be “specified”, or perhaps even prior to a language. CTMU features “telic recursion” involving agent-like “telors” that are “maximizing a generalized self-selection parameter”, in an anthropic way that is like increasing their own anthropic probability, or “measure”, in a way that generalizes evolutionary self-reproduction. It includes interpretations of physical phenomena such as quantum mechanics (“conspansion”) and “temporal directionality and accelerating cosmic expansion”. It also includes an interpretation of “intelligent design” as it conceives of agent-like entities creating themselves and each other in a recursive process.IntroductionThe introduction notes: “Among the most exciting recent developments in science are Complexity Theory, the theory of self-organizing systems, and the modern incarnation of Intelligent Design Theory, which investigates the deep relationship between self-organization and evolutionary biology in a scientific context not preemptively closed to teleological causation.”Complexity theory, in contrast to traditional physical reductionism, gives rise to “informational reductionism”, which is foundational on information rather than, say, atoms. However, this reductionism has similar problems to other reductionisms. Separating information and matter, Langan claims, recapitulates Cartesian dualism; therefore, CTMU seeks to unify these, developing “a conceptual framework in which the relationship between mind and matter, cognition and information, is made explicit.”DNA, although a form of information, is also embedded in matter, and would not have material effects without being read by a material “transducer” (e.g. a ribosome). Reducing everything to information, therefore, neglects the material embodiment of information processors.Intelligent design theory involves probabilistic judgments such as “irreducible complexity”, the idea that life is too complex and well-organized to have been produced randomly by undirected evolution. Such probabilistic judgments rely on either a causal model (e.g. a model of how evolution would work and what structures it could create), or some global model that yields probabilities more directly.Such a global model would have certain properties: “it must be rationally derivable from a priori principles and essentially tautological in nature, it must on some level identify matter and information, and it must eliminate the explanatory gap between the mental and physical aspects of reality.  Furthermore, in keeping with the name of that to be modeled, it must meaningfully incorporate the intelligence and design concepts, describing the universe as an intelligently self-designed, self-organizing system.”Creating such a model would be an ambitious project. Langan summarizes his solution: “How is this to be done? In a word, with language.”This recalls Biblical verses on the relation of God to language. John 1:1 states: “In the beginning was the Word, and the Word was with God, and the Word was God.” (NIV). Theologian David Bentley Hart alternatively translates this as: “In the origin there was the Logos, and the Logos was present with God, and the Logos was god.” The Greek term “logos” means “word” and “speech” but also “reason”, “account”, and “discourse”.Derrida’s frequently-misunderstood “there is nothing outside the text” may have a similar meaning.Langan continues: “Not only is every formal or working theory of science and mathematics by definition a language, but science and mathematics in whole and in sum are languages.”Formal logic as a language is a standard mathematical view. Semi-formal mathematics is more like a natural language than a formal language, being a method of communication between mathematicians that assures them of formal correctness. All mathematical discourse is linguistic but not vice versa; mathematics lacks the ability to refer to what is ill-defined, or what is empirical but indiscernible.Science expands mathematics to refer to more of empirical reality, models of it, and elements of such. Like mathematics, science is a language of precision, excluding from the discourse sufficiently ill-defined or ambiguous concepts; this makes science unlike poetry.Perhaps the empirical phenomena predicted by scientific discourse are not themselves language? Langan disagrees: “Even cognition and perception are languages based on what Kant might have called ‘phenomenal syntax’”.Kant, famously, wrote that all empirical phenomena must appear in spacetime. This provides a type constraint on empirical phenomena, as in type theory. Finite spacetime phenomena, such as images and videos, are relatively easy to formalize in type theory. In a type theoretic language such as Agda, the type of 100 x 100 black-and-white bitmaps may be written as “Vector (Vector Bool 100) 100”, where “Bool” is the type of Booleans (true/false), and “Vector A n” is a list of n elements each of type A.AI algorithms process inputs that are formatted according to the algorithm; for example, a convolutional neural network processes a rectangular array. So, the concept of a formal language applies to what we might think of as the “raw sense data” of a cognitive algorithm, and also to intermediate representations used by such algorithms (such as intermediate layers in a convolutional neural network).Langas conceptualizes the laws of nature as “distributed instructions” applying to multiple natural objects at once (e.g. gravity), and together as a “‘control language’ through which nature regulates its self-instantiations”. This recalls CPU or GPU concepts, such as instructions that are run many times in a loop across different pieces of data, or programs or circuitry replicated across multiple computing units.The nature of these laws is unclear, for example it is unclear “where” (if anywhere) they are located. There is an inherent difficulty of asking this question similar to asking, as an intelligent program running on a CPU, where the circuits of a CPU are; it is a wrong question to ask which memory register the circuits are located in, and analogously it may be a wrong question for us to ask at what physical coordinates the law of gravity is, although the CPU case shows that the “where” question may nonetheless have some answer.Langan seeks to extend the empirical-scientific methods of physics and cosmology to answer questions that they cannot: “science and philosophy do not progress by regarding their past investments as ends in themselves; the object is always to preserve that which is valuable in the old methods while adjoining new methods that refine their meaning and extend their horizons.”In the process, his approach “leaves the current picture of reality virtually intact”, but creates a “logical mirror image” or “conspansive dual” to the picture to create a more complete unified view (here, “conspansion” refers to a process of reality evolving that can be alternately viewed, dually, as space expanding or matter contracting).On Theories, Models and False DichotomiesLangan describes “reality theory”: “In the search for ever deeper and broader explanations, science has reached the point at which it can no longer deny the existence of intractable conceptual difficulties devolving to the explanatory inadequacies of its fundamental conceptual models of reality. This has spawned a new discipline known as reality theory, the study of the nature of reality in its broadest sense… Mainstream reality theory counts among its hotter foci the interpretation of quantum theory and its reconciliation with classical physics, the study of subjective consciousness and its relationship to objective material reality, the reconciliation of science and mathematics, complexity theory, cosmology, and related branches of science, mathematics, philosophy and theology.”Common discourse uses the concept of “real” often to distinguish conceptions by whether they have “actual” referents or not, but it is not totally clear how to define “real” or how such a concept relates to scientific theories or its elements. Reality theory includes a theory of its application: since reality theory seeks to describe the “real” and is in some sense itself “real”, it must describe how it relates to the reality it describes.Over time, continuum physics has “lost ground” to discrete computational/informational physics, in part due to the increased role of computer simulations in the study of physics, and in part due to quantum mechanics. Langan claims that, although discrete models have large advantages, they have problems with “scaling”, “nonlocality” (perhaps referring to how discrete models allow elements (e.g. particles) at nonzero distance from each other to directly influence each other), lack of ability to describe the “medium, device, or array in which they evolve”, the “initial states”, and “state-transition programming”.I am not totally sure why he considers discrete models to be unable to describe initial states or state-transition programming. Typically, such states and state transitions are described by discrete computer or mathematical specifications/instructions. A discrete physical model, such as Conway’s game of life, must specify the initial state and state transitions, which are themselves not found within the evolving list of states (in this case, binary-valued grids); however, this is also the case for continuous models.Langan also claims that discrete physical models are “anchored in materialism, objectivism, and Cartesian dualism”; such models typically model the universe from “outside” (a “view from nowhere”) while leaving unclear the mapping between such a perspective and the perspectives of agents within the system, leading to anthropic paradoxes.Langan notes that each of classical and informational reality, while well-defined, lacks the ability to “account for its own genesis”. CTMU seeks to synthesize classical with quantum models, attaining the best of both worlds.Determinacy, Indeterminacy and the Third Option Both classical and computational models have a mix of causality and stochasticity: a fully deterministic model would fail to account for phenomena that seem “fundamentally unexplainable” such as quantum noise. While causality and stochasticity seem to exhaust all possible explanations for empirical phenomena, Langan suggests self-determinacy as a third alternative, in which “a system determines its own composition, properties, and evolution independently of external laws and structures”.This suggests cyclic time as a possible analogy, or anthropics, in which the conditions of mental representation themselves determine the empirical, material circumstances such minds find themselves in.Langan notes cybernetic feedback (in which various entities regulate each other with positive and negative feedback, finding an equilibrium) as a possible analogy. However, he rejects this, since cybernetic feedback between entities “is meaningless where such entities do not already exist”. Accordingly, “the feedback is ontological in nature and therefore more than cybernetic.”Ontological feedback is a rather confusing concept. One visualization is to imagine a map that represents a world, and itself as a part of a world with a plausible origin; whenever such a map fails to find a plausible origin of itself, it (and the world it describes) fails to exist. This is in some ways similar to anthropic self-selection.Ontological feedback is “cyclical or recursive”, but while ordinary recursion (e.g. in a recursive algorithm) runs on informational components that already exist, ontological feedback deals with components that do not yet exist; therefore, a new type of feedback is required, “telic feedback”.Langan writes: “The currency of telic feedback is a quantifiable self-selection parameter, generalized utility, a generalized property of law and state in the maximization of which they undergo mutual refinement”. Generalized utility may be compared to “anthropic measure” or “evolutionary measure”, but it isn’t exactly the same. Since some systems exist and others don’t, a “currency” is appropriate, like probability is a currency for anticipations.Unlike probabilities over universe trajectories, telic feedback doesn’t match an acyclic time ordering: “In effect, the system brings itself into existence as a means of atemporal communication between its past and future”. There may be some relation to Newcomblike scenarios here, in which one’s existence (e.g. ability to sustain one’s self using money) depends on acausal coordination across space and time.Unlike with Newcomblike scenarios and ordinary probability theory, telic feedback deals with feedback over syntax, not just state. The language the state is expressed in, not merely the state itself, depends on this feedback. Natural languages work somewhat like this, in that the syntax of the English language depends on the state trajectory of historical evolution of language and culture over time; we end up describing this historical state trajectory using a language that is in large part a product of it.Similarly, the syntax of our cognitive representations (e.g. in the visual cortex) depends on the state trajectories of evolution, a process that is itself described using our cognitive representations.Even the formal languages of mathematics and computer science depend on a historical process of language and engineering; while it is tempting to say that Turing’s theory of computation is “a priori”, it cannot be fully a priori while being Turing’s. Hence, Langan describes telic feedback as “protocomputational” rather than “computational”, as a computational theory would assume as given syntax for describing computations.The closest model to “telic feedback” I have encountered in the literature is Robin Hanson’s “Uncommon Priors Require Origin Disputes”, which argues that different agents must share priors as long as they have compatible beliefs about how each agent originated. The similarity is imagining that different agents create representations of the world that explain their own and others’ origins (e.g. explaining humans as evolved), and these representations come together into some shared representation (which in Hanson’s formulation is a shared belief state, and in Langan’s is the universe itself), with agents being more “likely” or “existent” the more plausible their origin stories are (e.g. Hanson might appeal to approximately Bayesian beliefs being helpful for survival).My own analogy for the process is to some travelers from different places finding themselves at a common location, having little language in common, forming a pidgin, having origin stories about themselves, with their stories about their origins rejected if too implausible, such that there’s optimization for making their type of person seem plausible in the language.The Future of Reality Theory According to John Wheeler John Wheeler is a famous physicist who coined the term “black hole”. Langan discusses Wheeler’s views on philosophy of science in part because of the similarity of their views.In Beyond the Black Hole, Wheeler describes the universe as a “self-excited circuit”, analogized to a diagram of a U with an eye on the left branch of the U looking at the right branch of the U, representing how subject is contiguous with object. Viewing the universe as a self-excited circuit requires cognizing perception as part of the self-recognition of reality, and physical matter as informational and therefore isomorphic to perception.Wheeler describes the universe as “participancy”: the participation of observers is part of the dynamics of the universe. A participatory universe is “a ‘logic loop’ in which ‘physics gives rise to observer participancy; observer-participancy gives rise to information; and information gives rise to physics.’”The “participatory principle” is similar to the anthropic principle but stronger: it is impossible to imagine a universe without observers (perhaps because even the vantage point from which the universe is imagined from is a type of observer).  According to the participatory principle, “no elementary phenomenon is a phenomenon until it is an observed (or registered) phenomenon”, generalizing from quantum mechanics’ handling of classical states.Wheeler considers the question of where physical laws come from (“law without law”) to be similar to the question of how order comes from disorder, with evolution as an example. Evolution relies on an orderly physics in which the organisms exist, and there is an open question of whether the physical laws themselves have undergone a process analogous to evolution that may yield orderly physics from a less orderly process.Wheeler also considers explaining how the macroscopic universe we perceive comes from the low-level information processing of quantum mechanics (“It from bit”). Such an explanation must explain “How come existence?”: why do we see continuous time and space given a lack of physically fundamental time and space? It must also explain “How come the quantum?”, how does quantum mechanics relate to the world we see? And finally, it must explain “How come the ‘one world’ out of many observer-participants”: why do different agents find themselves in “the same” world rather than solipsistic bubbles?The “It from bit” explanation must, Wheeler says, avoid three errors: “no tower of turtles” (infinite regresses which ultimately fail to explain), “no laws” (lack of pre-existing physical laws governing continuum dynamics), “no continuum” (no fundamental infinitely divisible continuum, given lack of mathematical or physical support for such an infinity), “no space or time” (space and time lack fundamental existence: “Wheeler quotes Einstein in a Kantian vein: ‘Time and space are modes by which we think, and not conditions in which we live’”).Wheeler suggests some principles for constructing a satisfactory explanation. The first is that “The boundary of a boundary is zero”: this is an algebraic topology theorem showing that, when taking a 3d shape, and then taking its 2d boundary, the boundary of the 2d boundary is nothing, when constructing the boundaries in a consistent fashion that produces cancellation; this may somehow be a metaphor for ex nihilo creation (but I’m not sure how).The second is “No question? No answer”, the idea that un-asked questions don’t in the general case have answers, e.g. in quantum measurement the measurement being made (“question”) changes future answers, so there is no definite state prior to measurement. This principle implies a significant degree of ontological entanglement between observers and what they observe.The third is “The Super-Copernican Principle”, stating that no place or time (“now”) is special; our universe is generated by both past and future. It is rather uncontroversial that past observers affect present phenomena; what is rather more controversial is the idea that this isn’t enough, and the present is also influenced by future observers, in a pseudo-retrocausal manner. This doesn’t imply literal time travel of the sort that could imply contradictions, but is perhaps more of an anthropic phenomenon: the observations that affect the future “exist more” in some sense; observations are simultaneously summaries of the past and memories interpreted by the future. Sometimes I think my observations are more likely to come from “important” agents that influence the future (i.e. I think I’m more important than a random person), which, confusingly, indicates some influence of future observers on present measure.The fourth is “Consciousness”, stating that it’s hard to find a line between what is conscious and unconscious; the word “who” archetypally refers to humans, so overusing the concept indicates anthropocentrism.The fifth is “More is different”: there are more properties of a system that is larger, due to combinatorial explosion. Quantitative differences produce qualitative ones, including a transition to “multi-level logical structures” (such as organisms and computers) at a certain level of complexity.Langan notes: “Virtually everybody seems to acknowledge the correctness of Wheeler’s insights, but the higher-order relationships required to put it all together in one big picture have proven elusive.” His CTMU attempts to hit all desiderata.Some Additional PrinciplesAccording to Langan, Descartes argued that reality is mental (rationalism), but went on to assert mind-body dualism, which is contradictory (I don’t know enough about Descartes to evaluate this statement). Berkeley, an empiricist, said reality is perceptual, an intersection of mind and matter; if perception is taken out of one’s conception of reality, what is left is pure subjective cognition. Langan compares eliminativism, an attempt to subtract cognition from reality, to “trying to show that a sponge is not inherently wet while immersing it in water”: as cognitive entities, we can’t succeed in eliminating cognition from our views of reality. (I basically agree with this.)Hume claims causation is a cognitive artifact, substituting the “problem of induction”. Langan comments that “the problem of induction merely implies that a global theory of reality can only be established by the rational methods of mathematics, specifically including those of logic.” This seems like it may be a misread of Hume given that Hume argued that deductive reasoning was insufficient for deriving a global theory of reality (including causal judgments).Kant asserted that “unprimed cognition” exists prior to particular contexts (e.g. including time, space, and causation), but also asserts the existence of a disconnected “noumenal” realm, which Langan argues is irrelevant and can be eliminated.Scientists interpret their observations, but their interpretations are often ad hoc and lack justification. For example, it is unclear how scientists come up with their hypotheses, although cognitive science includes some study of this question, e.g. Bayesian brain theory. Langan investigates the question of attribution of meaning to scientific theories by walking through a sequence of more powerful logics.“Sentential logic” is propositional calculus; it reasons about truth values of various sentences. Propositional tautologies can be composed, e.g. X & Y is tautological if X and Y are. Predicate logic extends propositional logic to be able to talk about a possibly-infinite set of objects using quantifiers, assigning properties to these objects using predicates. Model theory further extends predicate logic by introducing universes consistent with axiom schemas and allowing reasoning about them.Langan claims reality theory must emulate 4 properties of sentential logic: absolute truth (truth by definition, as propositional calculus defines truth), closure (the logic being “wholly based on, and defined strictly within the bounds of, cognition and perception”), comprehensiveness (that the logic “applies to everything that can be coherently perceived or conceived”), and consistency (“designed in a way that precludes inconsistency”).While logic deals in what is true or false, reality theory deals in what is real or unreal (perhaps similar to the epistemology/ontology distinction). It must “describe reality on a level that justifies science, and thus occupies a deeper level of explanation than science itself”; it must even justify “mathematics along with science”, thus being “metamathematical”. To do this, it must relate theory and universe under a “dual aspect monism”, i.e. it must consider theory and universe to be aspects of a unified reality.Logicians, computer scientists, and philosophers of science are familiar with cases where truth is ambiguous: logical undecidability (e.g. Gödel’s incompleteness theorem), NP completeness (computational infeasibility of finding solutions to checkable problems), Lowenheim-Skolem (ambiguity of cardinalities of models in model theory), Duhem-Quine (impossibility of testing scientific theories in isolation due to dependence on background assumptions). Langan claims these happen because the truth predicate comes apart from “attributive mappings” that would assign meaning to these predicates. He also claims that falsificationist philosophy of science “demotes truth to provisional status”, in contrast to tautological reasoning in logic. (On the other hand, it seems unclear to me how to get any of science from tautologies, given the empirical nature of science.)Langan desires to create an “extension” to tautological logic to discuss physical concepts such as space, time, and law. He notes a close relationship between logic, cognition, and perception: for example, “X | !X” when applied to perception states that something and its absence can’t both be perceived at once (note that “X | !X” is equivalent to “!(X & !X)” in classical but not intuitionistic logic).Sentential logic, however, is incomplete on its own, since it needs a logician to interpret it. Nature, on the other hand, interprets itself, having “self-processing capability”. Accordingly, reality theory should include a mental component in its logic, allowing the logic to process itself, as if by an external mind but instead by itself.Langan states his main angle of attack on the problem: “the way to build a theory of reality is to identify the properties that it must unconditionally possess in order to exist, and then bring the theory into existence by defining it to possess these properties without introducing merely contingent properties that, if taken as general, could impair its descriptive relationship with the real universe (those can come later and will naturally be subject to empirical confirmation).”These properties will include the “3 C’s”: “comprehensiveness (less thorough but also less undecidable than completeness), closure, and consistency”. These will correspond to three principles, the “3 M’s”: “M=R, MAP and MU, respectively standing for the Mind Equals Reality Principle, the Metaphysical Autology Principle, and the Multiplex Unity Principle.” Briefly, M=R “dissolves the distinction between theory and universe… [making] the syntax of this theory comprehensive”, MAP “tautologically renders this syntax closed or self-contained”, and MU “tautologically renders this syntax, and the theory-universe complex it describes, coherent enough to ensure its own consistency”.CTMU’s definitions of concepts are unavoidably recursive, perhaps similarly to mutually recursive definitions in mathematics or programming. Langan claims: “Most theories begin with axioms, hypotheses and rules of inference, extract implications, logically or empirically test these implications, and then add or revise axioms, theorems or hypotheses. The CTMU does the opposite, stripping away assumptions and ‘rebuilding reality’ while adding no assumptions back.” This reminds of Kant’s project of stripping away and rebuilding metaphysics from a foundation of what must be the case a priori.The Reality PrincipleReality contains all and only that which is real, if something else influenced reality, it would be part of reality. As a definition this is circular: if we already accept the reality of a single thing, then reality of other things can be derived from their influence on that thing. The circularity invites some amount of ontological dispute over which foundational things can be most readily accepted as real. Langan considers an alternative definition: “Reality is the perceptual aggregate including (1) all scientific observations that ever were and ever will be, and (2) the entire abstract and/or cognitive explanatory infrastructure of perception”. This definition seems to lean idealist in defining reality as a perceptual aggregate, expanding from scientific observation in the direction of mind rather than matter.SyndiffeonesisLangan writes: “Syndiffeonesis implies that any assertion to the effect that two things are different implies that they are reductively the same; if their difference is real, then they both reduce to a common reality and are to that extent similar. Syndiffeonesis, the most general of all reductive principles, forms the basis of a new view of the relational structure of reality.”As an example, consider apples and oranges. They’re different, but what lets us know that they are different? Since they are both plants, they have DNA that can be compared to show that they are different. Also, since they both have a shape, their shapes can be compared and found to be different. Since they both have a taste, they can be tasted to tell that they are different. Each of these comparisons showing difference requires apples and oranges to have something in common, demonstrating syndiffeonesis.This principle can be seen in type theory; generally, to compare two terms for equality, the terms must have the same type, e.g. 5 and 6 can be found to be unequal since they are both natural numbers.The commonality is in medium and syntax: “The concept of syndiffeonesis can be captured by asserting that the expression and/or existence of any difference relation entails a common medium and syntax, i.e. the rules of state and transformation characterizing the medium.” Syntax can be seen in type theory, since terms that can be compared for equality are both written in the same type theoretic syntax. Medium is less straightforward; perhaps apples and oranges both existing in spacetime in the same universe would be an example of a common medium.Langan claims: “Every syndiffeonic relation has synetic and diffeonic phases respectively exhibiting synesis and diffeonesis (sameness and difference, or distributivity and parametric locality), and displays two forms of containment, topological and descriptive.” The common medium and syntax goes with the synetic phase, while the difference relation goes with the diffeonic phase. One can imagine comparing two things by finding the smallest common “supertype” of both (e.g. fruit for apples/oranges); in this case the specification from “something” to “a fruit” is synetic (in common between apples and oranges, specifying a common medium and syntax), and the specification from “a fruit” to “apple” or “orange” is diffeonic (showing that they are different fruits).If two things aren’t expressed in the same syntax, then the fact that their syntaxes are different itself is a diffeonic relation indicating an underlying, more base-level common syntax and medium. For example, while Python programs are syntactically different from Forth programs, they are both expressed as text files. Python files and apples have even less similar syntax, but both exist in physical space, and can be displayed visually. Langan adds: “Any such syndiffeonic regress must terminate, for if it did not, there would be no stable syntax and therefore no ‘relation’ stable enough to be perceived or conceived.”Langan uses the notation “X ∽ Y” to indicate the common medium shared by X and Y, with smallest common supertypes possibly being an example. If X and Y are different laws (e.g. physical), then X ~ Y denotes a common set of laws that both X and Y are expressed in; for example, many different physical laws can be expressed as instances of energy conservation.By using the ∽ operator to iteratively find a common medium for all possible perceptible and cognizable things, the universal base medium and syntax of reality is found. This is perhaps similar to a generative grammar of concepts, and is elaborated on in the SCSPL section.The Principle of Linguistic ReducibilityFollowing from the discussion of a common medium of reality, Langan writes: “Reality is a self-contained form of language”. It has representations of object-like individuals, space-like relations and attributes, and time-like functions and operators. Our theories of physics have these; physics is a language that can express many different specific physical theories.Langan argues: “because perception and cognition are languages, and reality is cognitive and perceptual in nature, reality is a language as well.” In typical moments, a person is aware of entities which are related and/or have functions applied to them, which could be analogized to language processing. Langan also adds, “whereof that which cannot be linguistically described, one cannot perceive or conceive”, following Wittgenstein’s “whereof one cannot speak, one must be silent”.Theories of everything attempt to reduce everything to a language. They point to objective matter, but such “pointing” is itself something contained in the whole, sharing structure with the theory; for example, a theory of mass may involve procedures for measuring mass, which tie the theory of mass with the objective subject matter. Such relation between theory and reality suggests the syndiffeonic relation “Language ∽ Reality”.The term “reality” can be analyzed as a linguistic construct: in what cases do words like “real” or “reality” show up, and when are these valid? Sometimes “real” shows up to indicate an inadequacy of a conception, e.g. inability to explain some empirical phenomenon, which is considered “real” unlike the predictions of the wrong theory.Langan is optimistic about understanding reality linguistically. If we understand reality as a linguistic element, does it follow that we understand reality? It is empirically always the case that our linguistic theories are inadequate in some way, failing to predict some phenomena, or imposing a wrong ontology that has holes; but even these failures can be understood as relations of the linguistic theory to something that can be incorporated into later linguistic theories.CTMU considers the base elements of reality to be “syntactic operators” that transform linguistic entities including themselves; reality is therefore conceptualized as a dynamical process transforming linguistic content such as theories. Insofar as our theories better approximate the real over time, there must be some sense in which reality is similar to a “syntactic operator”, although the details of the theory remain to be seen.Syntactic Closure: The Metaphysical Autology Principle (MAP) Langan writes: “All relations, mappings and functions relevant to reality in a generalized effective sense, whether descriptive, definitive, compositional, attributive, nomological or interpretative, are generated, defined and parameterized within reality itself.” As a result, reality is closed; there is no way of describing reality except in terms of anything real.The Metaphysical Autology Principle implies this sort of closure: reality theory must “take the form of a closed network of coupled definitions, descriptions, explanations and interpretations that refer to nothing external to reality itself”.Autology is the study of one’s self; reality studies itself in the sense of containing predicates about itself and informational manipulators (such as human scientists) that apply these predicates to reality. Reality theory requires a 2-valued logic distinguishing what is real or not real, e.g. it may contain the statement “a predicate of something real is real”.As an example, consider measuring the size of the universe with a unit length. With a standard ruler, it is possible to measure medium-sized objects, and with theory, it is possible to extrapolate to estimate the size of large objects such as the earth or solar system, or even the entire universe. However, the unit length (the standard ruler) is an object in the universe. There is no “view from nowhere” that contains a measuring unit that can be used to measure the universe. Reality is understood in terms of its own components.What if there is something like a view from nowhere, e.g. an outer universe simulating ours? “If an absolute scale were ever to be internally recognizable as an ontological necessity, then this would simply imply the existence of a deeper level of reality to which the scale is intrinsic and by which it is itself intrinsically explained as a relative function of other ingredients.” So we include the outer universe in “reality” and note that the outer unit is still part of reality.An approximate Solomonoff inductor predicts the reality generating its percepts as if it’s external. But, as theorists reasoning about it, we see that there’s a (Solomonoff inductor, external matter, I/O relation) system, so we know that the inductor is part of reality. Then we look at ourselves looking at this system and note that our reasoning about this inductor is, too, part of reality.Langan defines the “recurrent fallacy” to be: “The existence of the universe is given and therefore in no need of explanation.” “Is given” hides what needs to be explained, which should be part of reality; explaining reality in terms of reality implies some sort of cyclicality as discussed earlier.If the universe were inexplicable, that would imply that it came into being by magic; if there is no magic, the “five whys” must bottom out somewhere. I am less certain of Langan that there are no “magic” unexplained phenomena like fundamental randomness (e.g. in anthropics), but I understand that such explanations are inherently less satisfactory than successful deterministic ones.Syntactic Comprehensivity-Reflexivity: the Mind Equals Reality Principle (M=R)Langan defines the M=R principle: “The M=R or Mind Equals Reality Principle asserts that mind and reality are ultimately inseparable to the extent that they share common rules of structure and processing.” This is closely related to linguistic reducibility and can be represented as “Mind ∽ Reality”.Separating mind and reality (e.g. Cartesian dualism) assumes existence of a common medium translating between them. If the soul were in another dimension connected to the Pineal gland, that dimension would presumably itself be in some ways like physical spacetime and contain matter.Langan writes: “we experience reality in the form of perceptions and sense data from which the existence and independence of mind and objective external reality are induced”. This is similar to Kant’s idea that what we perceive are mental phenomena, not noumena. Any disproof of this idea would be cognitive (as it would have to be evaluated by a mind), undermining a claim of mind-independence. (I am not sure whether this is strictly true; perhaps it’s possible to be “hit” by something outside your mind that is not itself cognition or a proof, which can nonetheless be convincing when processed by your mind?). Perceptions are, following MAP, part of reality.He discusses the implications of a Kantian phenomenon/noumenon split: “if the ‘noumenal’ (perceptually independent) part of reality were truly unrelated to the phenomenal (cognition-isomorphic) part, then these two ‘halves’ of reality would neither be coincident nor share a joint medium relating them. In that case, they would simply fall apart, and any integrated ‘reality’ supposedly containing both of them would fail for lack of an integrated model.” Relatedly, Nietzsche concluded that the Kantian noumenon could be dropped, as it is by definition unrelated to any observable phenomena.Syntactic Coherence and Consistency: The Multiplex Unity Principle (MU)Langan argues: “we can equivalently characterize the contents of the universe as being topologically ‘inside’ it (topological inclusion), or characterize the universe as being descriptively ‘inside’ its contents, occupying their internal syntaxes as acquired state (descriptive inclusion).”Topological inclusion is a straightforward interpretation of spacetime: anything we see (including equations on a whiteboard) are within spacetime. On the other hand, such equations aim to “capture” the spaciotemporal universe; to the extent they succeed, the universe is “contained” in such equations. Each of these contaminants enforces consistency properties, leading to the conclusion that “the universe enforces its own consistency through dual self-containment”.The Principle of Hology (Self-composition)Langan writes: “because reality requires a syntax consisting of general laws of structure and evolution, and there is nothing but reality itself to serve this purpose, reality comprises its own self-distributed syntax under MU”. As a special case, the language of theoretical physics is part of reality and is a distributed syntax for reality.Duality PrinciplesDuality commonly shows up in physics and mathematics. It is a symmetric relation: “if dualizing proposition A yields proposition B, then dualizing B yields A.” For example, a statement about points (e.g. “Two non-coincident points determine a line”) can be dualized to one about lines (“Two non-parallel lines determine a point”) and vice versa.Langan contrasts between spatial duality principles (“one transposing spatial relations and objects” and temporal duality principles (“one transposing objects or spatial relations with mappings, functions, operations or processes”). This is now beyond my own understanding. He goes on to propose that “Together, these dualities add up to the concept of triality, which represents the universal possibility of consistently permuting the attributes time, space and object with respect to various structures”, which is even more beyond my understanding.The Principle of Attributive (Topological-Descriptive, State-Syntax) DualityThere is a duality between sets and relations/attributes. The set subset judgment “X is a subset of Y” corresponds to a judgment of implication of attributes, “Anything satisfying X also satisfies Y”. This relates back to duality between topological and descriptive inclusion.Sets and logic are described with the same structure, e.g. logical and corresponds with set intersection, and logical or corresponds with set union. Set theory focuses on objects, describing sets in terms of objects; logic focuses on attributes, describing constraints to which objects conform. The duality between set theory and logic, accordingly, relates to a duality between states and the syntax to which these states conform, e.g. between a set of valid grammatical sentences and the logical grammar of the language.Langan writes that the difference between set theory and logic “hinges on the univalent not functor (~), on which complementation and intersection, but not union, are directly or indirectly defined.” It is clear that set complement is defined in terms of logical not. I am not sure what definition of intersection Langan has in mind; perhaps the intersection of A and B is the subset of A that is not outside B?Constructive-Filtrative DualityConstruction of sets can be equivalently either additive (describing the members of the set) or subtractive (describing a restriction of the set of all sets to ones satisfying a given property). This leads to constructive-filtrative duality: “CF duality simply asserts the general equivalence of these two kinds of process with respect to logico-geometric reality…States and objects, instead of being constructed from the object level upward, can be regarded as filtrative refinements of general, internally unspecified higher-order relations.”CF duality relates to the question of how it is possible to get something from nothing. “CF duality is necessary to show how a universe can be ‘zero-sum’; without it, there is no way to refine the objective requisites of constructive processes ‘from nothingness’.  In CTMU cosmogony, ‘nothingness’ is informationally defined as zero constraint or pure freedom (unbound telesis or UBT), and the apparent construction of the universe is explained as a self-restriction of this potential.”In describing the universe, we could either have said “there are these things” or “the UBT is restricted in this way”. UBT is similar to the God described in Spinoza’s Ethics, an infinite substance of which every finite thing is a modification, and to the Tegmark IV multiverse.As an application, consider death: is death a thing, or is it simply that a life is finite? A life can be constructed as a set of moments, or as the set of all possible moments restricted by, among other things, finite lifespan, death as a filter restricting those moments after the time of death from being included in life, similar to Spinoza’s idea that anything finite is derived by bounding something infinite.Conspansive Duality There is a duality between cosmic expansion and atom shrinkage. We could either posit that the universe is expanding and the atoms are accordingly getting further apart as space stretches, or we could equivalently posit that atoms themselves are shrinking in a fixed-size space, such that the distances between atoms increase relative to the sizes of each atom.This is an instance of an ectomorphism: “Cosmic expansion and ordinary physical motion have something in common: they are both what might be called ectomorphisms. In an ectomorphism, something is mapped to, generated or replicated in something external to it.” For example, a set of atoms may be mapped to a physical spacetime that is “external” to the atoms.Langan critiques ectomorphisms: “However, the Reality Principle asserts that the universe is analytically self-contained, and ectomorphism is inconsistent with self-containment.” Since spacetime is part of reality, mapping atoms to spacetime is mapping them into reality; however, it is unclear how to map spacetime itself to any part of reality. See also Zeno’s Paradox of Place.In contrast, in endomorphism, “things are mapped, generated or replicated within themselves”. An equation on a whiteboard is in the whiteboard, but may itself describe that same whiteboard; thus, the whiteboard is mapped to a part of itself.Langan specifically focuses on “conspansive endomorphism”, in which “syntactic objects are injectively mapped into their own hological interiors from their own syntactic boundaries.” I am not sure exactly what this means; my guess is that it means that linguistic objects (“syntactic objects”) are mapped to the interior of what they describe (what is within their “syntactic boundaries”); for example, an equation on a whiteboard might map to the interior of the whiteboard described by the equation.Conspansion “shifts the emphasis from spacetime geometry to descriptive containment, and from constructive to filtrative processing”, where physical equations are an example of filtration processing, as they describe by placing constraints on their subject matter.In a conspansive perspective on physics, “Nothing moves or expands ‘through’ space; space is state, and each relocation of an object is just a move from one level of perfect stasis to another.” In Conway’s Game of Life, each space/state is the state of cells, a grid. Each state is itself static, and “future” states follow from “previous” states, but each particular state is static.A Minkowsky diagram is a multidimensional graph showing events on a timeline, where time is one of the axes. Interactions between events represent objects, e.g. if in one event a ball is kicked and in another the ball hits the wall, the ball connects these events. This is similar to “resource logics” such as variants of linear logic, in which the “events” correspond to ways of transforming propositions to other propositions, and “objects” correspond to the propositions themselves.In a quantum context, events include interactions between particles, and objects include particles. Particles don’t themselves have a consistent place or time, as they move in both space and time; events, however, occur at a particular place and time. Due to speed of light limits, future events can only follow from past events that are in their past lightcone. This leads to a discrete, combinatorial, rhizomic view of physics, in which events proceed from combinations of other events, and more complex events are built from simpler earlier events. Accordingly, “spacetime evolves linguistically rather than geometrodynamically”.From a given event, there is a “circle” of possible places where future events could arise by a given time, based on the speed of light. “Time arises strictly as an ordinal relationship among circles rather than within circles themselves.” Langan argues that, by reframing spacetime and events this way, “Conspansion thus affords a certain amount of relief from problems associated with so-called ‘quantum nonlocality’.” Locality is achieved by restricting which events can interact with other events based on those events’ positions and times, and the position and time of the future interactive event. (I don’t understand the specific application to quantum nonlocality.)Properties of events, including time and place, are governed by the laws of physics. Somewhat perplexingly, Langan states: “Since the event potentials and object potentials coincide, potential instantiations of law can be said to reside ‘inside’ the objects, and can thus be regarded as functions of their internal rules or ‘object syntaxes’.” My interpretation is that objects restrict what events those objects can be part of, so they are therefore carriers of physical law. I am not really sure how this is supposed to, endomorphically, place all physical law “inside” objects; it is unclear how the earliest objects function to lawfully restrict future ones. Perhaps the first object in the universe contains our universe’s original base physical laws, and all future objects inherit at least some of these, such that these laws continue to be applied to all events in the universe?Langan contrasts the conspansive picture presented with the more conventional spacetime/state view: “Thus, conspansive duality relates two complementary views of the universe, one based on the external (relative) states of a set of objects, and one based on the internal structures and dynamics of objects considered as language processors. The former, which depicts the universe as it is usually understood in physics and cosmology, is called ERSU, short for Expanding Rubber Sheet Universe, while the latter is called USRE (ERSU spelled backwards), short for Universe as a Self-Representational Entity.”Langan claims conspansive duality “is the only escape from an infinite ectomorphic ‘tower of turtles’”: without endomorphism, all objects must be mapped to a space, which can’t itself be “placed” anywhere without risking infinite regress. (Though, as I said, it seems there would have to be some sort of original object to carry laws governing future objects, and it’s unclear where this would come from.)He also says that “At the same time, conspansion gives the quantum wave function of objects a new home: inside the conspanding objects themselves.” I am not really sure how to interpret this; the wave function correlates different objects/particles, so it’s unclear how to place the wave function in particular objects.The Extended Superposition Principle “In quantum mechanics, the principle of superposition of dynamical states asserts that the possible dynamical states of a quantized system, like waves in general, can be linearly superposed, and that each dynamical state can thus be represented by a vector belonging to an abstract vector space”: in general, wave functions can be “added” to each other, with the probabilities (square amplitudes) re-normalizing to sum to 1.Langas seeks to explain wave function collapse without resort to fundamental randomness (as in the Copenhagen interpretation). Under many worlds, the randomness of the Born rule is fundamentally anthropic, as the uncertainty over one’s future observations is explained by uncertainty over “where” one is in the wave function.Physical Markovianism is a kind of physical locality property where events only interact with adjacent events. Conspansion (“extended superposition”) allows events to interact non-locally, as long as the future events are in the light cones of the past events. Langan claims that “the Extended Superposition Principle enables coherent cross-temporal telic feedback”.Telons are “utile state-syntax relationships… telic attractors capable of guiding cosmic and biological evolution”, somewhat similar to decision-theoretic agents maximizing their own measure. The non-locality of conspansion makes room for teleology: “In extending the superposition concept to include nontrivial higher-order relationships, the Extended Superposition Principle opens the door to meaning and design.” Since teleology claims that a whole system is “designed” according to some objective, there must be nonlocal dependencies; similarly, in a Bayesian network, conditioning on the value of a late variable can increase dependencies among earlier variables.SupertautologyTruth can be conceptualized as inclusion in a domain: something is real if it is part of the domain of reality. A problem for science is that truth can’t always be determined empirically, e.g. some objects are too far away to observe.Langan claims that “Truth is ultimately a mathematical concept…truth is synonymous with logical tautology”. It’s unclear how to integrate empirical observations and memory into such a view.Langan seeks to start with logic and find “rules or principles under which truth is heritable”, yielding a “supertautological theory”. He claims that the following can be mathematically deduced: “nomological covariance, the invariance of the rate of global self-processing (cinvariance), and the internally-apparent accelerating expansion of the system.”Reduction and Extension In reduction, “The conceptual components of a theory are reduced to more fundamental component”; in extension, the theory is “extended by the emergence of new and more general relationships among [fundamental components].” These are dual to each other.“The CTMU reduces reality to self-transducing information and ultimately to telesis, using the closed, reflexive syntactic structure of the former as a template for reality theory.” Scientific explanations need to explain phenomena; it is possible to ask “five whys”, so that scientific explanations can themselves be explained. It is unclear how this chain could bottom out except with a self-explanatory theory.While biologists try to reduce life to physics, physics isn’t self explanatory. Langan claims that “to explain organic phenomena using natural selection, one needs an explanation for natural selection, including the ‘natural selection’ of the laws of physics and the universe as a whole.”“Syndiffeonic regression” is “The process of reducing distinctions to the homogeneous syntactic media that support them”. This consists of looking at different rules and finding a medium in which they are expressed (e.g. mathematical language). The process involves “unisection”, which is “a general form of reduction which implies that all properties realized within a medium are properties of the medium itself”.The Principle of Infocognitive Monism  Although information is often conceptualized as raw bits, information is self-processing because it comes with structure; a natural language sentence has grammar, as do computer programs, which generally feature an automated parser and checker.Engineering information fields assume “the existence of senders, receivers, messages, channels and transmissive media is already conveniently given”, e.g. computer science assumes the existence of a Turing complete computer. This leaves unclear how these information-processing elements are embedded (e.g. in matter).“SCSPL” stands for “self configuring self processing language”, which has some things in common with a self-modifying interpreter.Telic Reducibility and Telic Recursion “Telic recursion is a fundamental process that tends to maximize a cosmic self-selection parameter, generalized utility, over a set of possible syntax-state relationships in light of the selfconfigurative freedom of the universe”: it is a teleological selection mechanism on infocognition, under which structures that achieve higher “generalized utility” are more likely to exist. This is perhaps a kind of self-ratification condition, where structures that can explain their own origins are more likely to exist.It is unclear how to explain physical laws, which themselves explain other physical phenomena. Objects and laws are defined in terms of each other, e.g. mass is a property of objects and is measured due to the laws relating mass to measurable quantities. Due to this, Langan argues that “the active medium of cross-definition possesses logical primacy over laws and arguments alike and is thus pre-informational and pre-nomological in nature…i.e., telic. Telesis… is the primordial active medium from which laws and their arguments and parameters emerge by mutual refinement or telic recursion”.It is unclear how to imagine a “pre-informational” entity. One comparison point is language: we find ourselves speaking English, and referring to other languages within English, but this didn’t have to be the case, the language could have been different. Perhaps “pre-informational” refers to a kind of generality beyond the generality allowing selection of different natural languages?Telesis even comes before spacetime; there are mental states in which spacetime is poorly defined, and mathematicians and physicists have refined their notion of spacetime over, well, time. (Langan therefore disagrees with Kant, who considers spacetime a priori).Langan contrasts two stages of telic recursion: “Telic recursion occurs in two stages, primary and secondary (global and local). In the primary stage, universal (distributed) laws are formed in juxtaposition with the initial distribution of matter and energy, while the secondary stage consists of material and geometric state-transitions expressed in terms of the primary stage.”It makes sense for physical laws to be determined along with initial state: among other things, states are constrained by laws, and state configurations are more or less likely depending on the laws.It sounds like the secondary stage consists of, roughly, dynamical system or MDP-like state transitions. However, Langan goes on to say that “secondary transitions are derived from the initial state by rules of syntax, including the laws of physics, plus telic recursion”. These views are explicitly contrasted: “The CTMU, on the other hand [in contrast to deterministic computational and continuum models of reality], is conspansive and telic-recursive; because new state-potentials are constantly being created by evacuation and mutual absorption of coherent objects (syntactic operators) through conspansion, metrical and nomological uncertainty prevail wherever standard recursion is impaired by object sparsity.”Telic recursion provides “reality with a ‘self-simulative scratchpad’ on which to compare the aggregate utility of multiple self-configurations for self-optimizative purposes”; one can imagine different agent-like telors “planning out” the universe between them with a shared workspace. Since telic recursion includes the subject matter of anthropics, CTMU implies that anthropics applies after the universe’s creation, not just before. Langan claims that telors are “coordinating events in such a way as to bring about its own emergence (subject to various more or less subtle restrictions involving available freedom, noise and competitive interference from other telons)”; the notion of “competitive interference” is perhaps similar to Darwinian competition, in which organisms are more likely to exist if they can bring similar organisms about in competition with each other.The Telic Principle The Telic principle states: “the universe configures itself according to the requirement that it self-select from a background of undifferentiated ontological potential or telesis…The Telic Principle is responsible for converting potential to actuality in such a way as to maximize a universal self-selection parameter, generalized utility.”In science, teleology has fallen out of favor, being replaced with the anthropic principle. Anthropics is a case of teleological selection, in which the present determines the past, at least subjectively (the requirement that life exist in the universe determines the universe’s initial conditions).The Weak Anthropic Principle, which states that we must find ourselves in a universe that has observers, fails to explain why there is a multiverse from which our universe is “selected” according to the presence of observers. The multiverse view can be contrasted with a fine-tuning view, in which there is possible only a single universe that has been “designed” so as to be likely to contain intelligent life.The Strong Anthropic Principle, on the other hand, states that only universes with intelligent life “actually exist”. This makes reality non-objective in some sense, and implies that the present can determine the past. Anthropics lacks a loop model of self-causality, by which such mutual causality is possible.We find ourselves in a self consistent structure (e.g. our mathematical and physical notation), but it could have been otherwise, since we could use a different language or mathematical notation, or find ourselves in a universe with different laws. It would therefore be an error to, employing circular reasoning, claim that our consistent structures are universal.Langan claims that “Unfortunately, not even valid tautologies are embraced by the prevailing school of scientific philosophy, falsificationism”, as tautologies are unfalsifiable. I think Popper would say that tautologies and deductive reasoning are necessary for falsificationist science (in fact, the main motivation for falsificationism is to remove the need for Humean induction).For anthropic arguments to work, there must be some universal principles: “If the universe is really circular enough to support some form of ‘anthropic’ argument, its circularity must be defined and built into its structure in a logical and therefore universal and necessary way. The Telic principle simply asserts that this is the case; the most fundamental imperative of reality is such as to force on it a supertautological, conspansive structure.” I think this is basically correct in that anthropic reasoning requires forms of reasoning that go beyond the reasoning one would use to reason about a universe “from outside”; the laws of the universe must be discoverable from inside and be consistent with such discovery.The anthropic selection of the universe happens from “UBT”: “Thus, the universe ‘selects itself’ from unbound telesis or UBT, a realm of zero information and unlimited ontological potential, by means of telic recursion, whereby infocognitive syntax and its informational content are cross-refined through telic (syntax-state) feedback over the entire range of potential syntax-state relationships, up to and including all of spacetime and reality in general.” Trivially, the a priori from which the universe is anthropically selected must not contain information specifying the universe, as this process is what selects this information. UBT could be compared to the Spinozan god, a substance which all specific entities (including the empirical physical universe) are modes of, or to the Tegmark IV multiverse. Telic recursion, then, must select the immanent empirical experience of this universe out of the general UBT possibility space.The telic principles implies some forms of “retrocausality”:  “In particular, the Extended Superposition Principle, a property of conspansive spacetime that coherently relates widely separated events, lets the universe ‘retrodict’ itself through meaningful cross-temporal feedback.” An empirical observation of a given universe may be more likely not just because of its present and past, but because of its future, e.g. observations that are more likely to be remembered may be considered more likely (and will be more likely in the empirical remembered past).Maximization of generalized utility is a kind of economic principle. The self tries to exist more; evolution implies something like this behavior at the limit, although not before the limit. This framework can’t represent all possible preferences, although in practice many preferences are explained by it anyway.ConclusionThis as far as I got in the summary and review. The remaining sections describe general computer science background such as the Chomsky hierarchy, and SCSPL, a model of reality as a self-processing language.Overall, I think Langan raises important questions that conventional analytic philosophy has trouble with, such as what more general principle underlies anthropics, and how to integrate cognition into a physics-informed worldview without eliminating it. He presents a number of concepts, such as syndiffeonesis, that are useful in themselves.The theory is incredibly ambitious, but from my perspective, it didn’t deliver on them. This is partially because the document was hard to understand, but I’m not convinced I’d think CTMU delivers on its ambition if I fully understood it. It’s an alternative ontology, conceiving of reality as a self-processing language, which avoids some problems of more mainstream theories, but has problems of its own, and seems quite underspecified in the document despite the use of formal notation. In particular, I doubt that conspansion solves quantum locality problems as Langan suggests; conceiving of the wave function as embedded in conspanding objects seems to neglect correlations between the objects implied by the wave function, and the appeal to teleology to explain the correlations seems hand-wavey.A naive interpretation of CTMU would suggest time travel is possible through telesis, though I doubt Langan would endorse strong implications of this. I’ve written before on anthropics and time travel; universes that don’t basically factor into a causal graph tend to strongly diverge from causality, e.g. in optimizing for making lots of time turners pass the same message back without ever passing a different message back. Anthropics shows that, subjectively, there is at least some divergence from a causal universe model, but it’s important to explain why this divergence is fairly bounded, and we don’t see evidence of strong time travel, e.g. hypercomputation.Despite my criticisms of the document, it raises a number of important questions for mainstream scientific philosophy, and further study of these questions and solutions to them, with more explication for how the theory “adds up to normality” (e.g. in the cause of causality), might be fruitful. Overall, I found it worthwhile to read the document even though I didn’t understand or agree with all of it."}
{"title": "Love and Dating in Death Note", "link": "https://unstablerontology.substack.com/p/love-and-dating-in-death-note", "date": "2024-03-18T21:50:10.297Z", "content": "I watched Death Note for the first time as a teenager and recently re-watched it. Both times, it was so exhilarating that I finished the series in a span of two days. This is currently one of my two favorite animes, along with Shin Sekai Yori.I had the common experience during the anime of yelling at the characters (in my head or actually out loud) because of how stupidly they are behaving. Normally people would consider this evidence of bad writing. But I actually think it’s evidence of good writing, at least in this case. In Death Note, the game that characters are playing is obvious enough that suboptimal strategies are recognizable. The world of Death Note is, mostly, the real world with some additional rule-bound supernatural mechanics. Contrast this with most fiction, where the world works on unclear rules, and characters are playing unclear games. In that case it’s harder to say that the characters are being stupid, because for the most part, they’re not even wrong.Since Death Note has relatively clear game mechanics, it sheds some light on areas of life that have game interpretations, but which generally resist formalization. These include dating and love, especially romantic love.Death Note’s dating is cliché in places, but this is fine: it’s presenting an uncommon perspective on the supernatural and strategy, not so much dating. From studying the new game-mechanical context of Death Note, perhaps some information can be gleaned about normal, cliché conceptions of dating.Death Note doesn’t contain sex scenes and has very few references to sex. Dating in Death Note isn’t about sex or reproduction, it’s about power. While dating is usually at least a little about sex, dating can exist at higher simulacra levels.While some of the generalizations below are fairly obvious, others are less so. I’m including the basic ones to get a more complete sense of the model of love and dating in the series, without skipping over implied background.Major spoiler warnings ahead. I’ll assume basic familiarity with the plot of Death Note from now on. In general, I recommend watching the series without spoilers.If you’re popular, more people want to date youPerhaps the first reference to dating in Death Note is when Light goes on a date with a high school classmate, Yuri. He mentions to Ryuk that he had a few different people in mind for this, because he’s a popular guy.However Yuri feels about Light, Light doesn’t care much for her. He has a number of options, about as good as each other, and he picked her arbitrarily. He didn’t intend to date her long-term; he wanted to go on a single date, to have an excuse for riding on a particular bus while he was being followed by an FBI investigator. The investigator (Raye Penber) notes that it’s very normal of him to go on a date on his day off, and he reduces his level of suspicion. Yuri is a throwaway date; Light doesn’t care how the strange events on the bus will look to Yuri, he cares how he looks to Raye, and how being with Yuri will make him look.If you love someone, you might avenge their deathAfter Light kills Raye Perbur, Raye’s fiancé Naomi Misora, a former FBI investigator, catches on that something unusual is afoot, involving Kira (the possessor of the power to cause death supernaturally, in this case Light Yagami, though his identity is unknown). Raye did not want Naomi looking into the Kira case, for the sake of her own safety; he preferred her as a cloistered fiancé to a fellow Kira investigator. But Naomi suspects that Kira killed Raye, and that Kira may have been on the bus with him.She goes to the police station, where she attempts to report this information to the Kira investigators, but she fails because the investigators aren’t there. Light is there, however, and appears very helpful to her. Eventually, he betrays and kills her; it’s too much of a threat that she has information linking him to Kira, and that she has the motive to avenge her late fiancé.If you love someone, you might kill and die for themGelus, a Shinigami, falls in love with an attractive model named Misa Amane. Love between Shinigami and humans, of course, differs in some ways with romantic love between humans, but there are some similarities. When Misa is attacked by a stalker, who intends to kill both of them if they don’t date each other, Gelus writes the stalker’s name in his notebook, killing him and saving Misa. But this is against the rules of the Shinigami realm, so Gelus dies, and his lifespan is transferred to Misa’s. There is apparently no self-interested reason for Gelus to do this; it is an act of sacrifice, out of love.If you love someone, you’ll want to meet themMisa Amane gains Gelus’s Death Note, and she takes the deal to gain Shinigami eyes (the power to see people’s names and lifespans), in exchange for half her remaining lifespan. She sends some tapes to Sakura TV, speaking as Kira. When the police try to interfere, she uses the Shinigami eyes to kill some of them, to ensure that the tapes play.Light, now ironically on the Kira investigation team, is told by L, the head investigator, to create a tape to reply as Kira. This tape tells the second Kira to stop killing innocent people, and it tells the public that these are two different people. While L suspects Light of being Kira, the shared understanding of the team is that this is a fake message from Kira, even though in fact it is actually from Kira.The second Kira, Misa, replies that she would like to meet the first Kira, and broadcasts a cryptic document listing various locations. Since she loves Light Yagami, she is willing to go to great lengths to meet him, taking risks such as sending the tapes to Sakura TV and killing people who interfere.If someone loves you, they won’t kill youMisa has the power to kill anyone whose face she sees, so meeting with her is a risky endeavor. Light, still posing as an investigator, walks in front of a location he thinks the second Kira might be at with a crowd, to conceal his identity (specifically, who Ryuk was following). Since Misa has the Shinigami eyes, she can see the lifespan of anyone except another Death Note user; this is not known to Light. Since she can’t see Light’s lifespan, she identifies him as Kira, and gets his name.Light does not spot Misa, as she is disguised. He took a risk to walk past a location he thought the second Kira was at, even in a crowd. Misa could have killed him at any time after seeing his face. While he’s unsure about the second Kira’s intentions, he takes the expressed intention to meet secretly as a positive sign, and his judgment is correct; Misa would much prefer to serve Light than to kill him.If you’re dating someone, you can be in the same bedroom as themMisa arrives at Light’s house, and tells his mother and sister that she’s here to see Light. When they go up to his bedroom, he explains to his mother and sister that she’s the girl he was telling them about earlier, who he was dating. This is made up on the spot, to explain why they’re going to his room together. It’s normal for people who are dating to be in the same bedroom with the door closed, and otherwise it might raise suspicion.If you love someone, you’re likely to obey and trust themMisa explains to Light that she had her occultist friend dub the Sakura TV tapes and send them in, so they can’t be traced to her. When Light inquires as to this friend’s current situation, Misa says she will kill her if Light wants that. Even though she has just met Light, her relationship with him transcends the other relationships in her life; she would kill a friend at Light’s whim.Misa also offers to let Light hold on to her Death Note. This would give Light a great deal of power over Misa, as he could kill her, but she couldn’t kill him. The idea that she loves Light is more credible to him, because obeying him to this degree is hard to explain from a motive other than love. Effectively, she trusts him a lot, even if he thinks he might use her.If someone does something you like a lot, you’re more likely to love themMisa explicitly says that she doesn’t care if Light uses her. Light asks how she can say something like that. She explains that her parents were killed by a burglar before her eyes. The trial was drawn out, but Kira (Light) punished the burglar by killing him. As such, Kira means everything to her.Loving someone who doesn’t love you back can lead to an exploitative relationshipLight hugs Misa, and she is overcome with emotion. He explains that, while he can’t be her boyfriend, he can play the part, and that the Shinigami eyes will be a powerful weapon. He thinks to himself that he plans to have her see L and kill him, and will kill Misa afterwards, since only she knows Kira’s identity. Misa’s love for Light leads her to accepting him having power over her; since he doesn’t love her back, this is an opportunity to exploit her.People who are dating meet with each other often, when they canHilariously, after Light agrees to officially date Misa, Misa tries to list the rules of dating, one of which is that they go on a date at least once a week. This is a normal occurrence in dating, yet it is unusual to list it explicitly as a rule. Light explains that seeing her too often would raise suspicion, as it’s a connection between the two Kiras.People who are dating don’t want their partner dating other peopleLight explains that, to avoid raising suspicions, he will date other girls. Misa gets angry and says that if she sees him with another girl, she will kill her. This is a rather extreme threat, enabled by Misa’s Death Note powers, but has some similarities with ordinary romantic jealousy. In context, this is romantically coercive, as Light has a good reason to date Misa for his own protection (from her and others), and Misa is threatening to eliminate his other options. This is the only exception Misa gives to her obedience to Light. (Polyamory is not explored in the series.)Love can be at first sightMisa says she loves Light more than the world. Light is confused, since as a Kira admirer, she would more likely love Kira because she agrees with his plan to change the world. Misa explains that, while she was interested in Kira because of Kira avenging her parents, she fell in love with Light upon seeing him for the first time. While love can be a consequence of abstract information, it can also result from an immediate aesthetic impression.You’re more willing to obey the love interest of someone you loveLight notes that Misa’s threat is empty, as he holds both notebooks. He says he will kill her if she disobeys. Rem, Misa’s Shinigami, says he cannot do that; she will kill him if he tries to kill Misa, or even if Misa dies before her default lifespan, which Rem can see. Obviously, this would end Rem’s own life; Rem must have, like Gelus, fallen in love with Misa. Light realizes that, to survive, he must protect Misa from the police. (Later, Misa tells Rem not to actually kill Light; she does love him, after all.)Light addresses this threat by asking Rem if Misa being happy would make her happy. Of course, she says yes. He asks Misa if Light being happy would make her happy, to which she also of course says yes. He realizes he might be able to get Rem to obey him this way; he asks Misa to ask Rem to kill L. With the head investigator gone, Light and Misa would be safe and happy, and able to love each other more. Rem accepts, agreeing to kill L when Light commands it in the future; since she doesn’t like Light, this won’t make her die. While this transitive love allows Light to command Rem, it doesn’t cause Rem to love Light for the purposes of the Shinigami death.People who are dating share cell phone numbersLight, seeking to kill L, needs a way to contact Misa, so he asks for her cell phone number. She responds, “It’s about time!”; when he explains that she can’t have his cell phone number, to avoid raising suspicion, she replies “Why not? We’re lovers!”.To Misa, sharing cell phone numbers is an important part of dating; it enables them to contact each other and talk whenever they want to. She solves the dilemma by giving her an old phone of hers, which he can use to call her and vice versa.Kissing someone can keep them in love with youMisa likes the idea of having a somewhat normal romantic relationship with Light; he’s going to call her about killing L, and while this isn’t a normal boyfriend/girlfriend conversation, at least it’s a call. She fantasizes about having dinner with him, looking at the night sky, and after that, “the main event” (a rare sexual reference in the series). He suddenly kisses her, and she leaves his home blissfully. Later, he explains to Ryuk that he kissed her because he needs her to stay in love with him.Dating an attractive person is desirableEarlier, Light’s mom and sister had said they were worried about Misa but were glad she was cute. L, upon meeting Misa, says he’s jealous of Light; he’s been a huge fan of Misa, seeing some of her modeling in a magazine. Dating an attractive person such as Misa is agreed to be desirable, and cause for jealousy.Someone who loves someone else will use planning and ingenuity to save themThough Misa meets L, she does not get a chance to give Light his name, as she is dragged away by a manager and later by police. L puts her in extreme confinement and interrogates her. She asks Rem to kill her due to the discomfort, but Rem suggests another plan: she can give up her notebook and lose her memories of ever being the second Kira, so that her confinement will only show her innocence. Rem explains this plan to Light after executing this step, and she says she will kill him if he doesn’t save Misa.Since Rem loves Misa, she does not want to kill her, but plans out a way to save her. Light makes further plans, under Rem’s threat: one of the notebooks will be buried, and one will be given to a power-hungry person. He will accept confinement and give up his own notebook to show his innocence.Love for a concrete person exceeds love for an abstract personAfter L releases Misa and Light from confinement, he asks Misa if she would pick Kira or Light. She says Light, of course; while she admires Kira and would like to meet him, that’s not love, whereas she loves Light. (Remember that Misa and Light currently lack their memories of being Kira.) L explains that Light wants to catch Kira. Accordingly, Misa says that if Light wants to catch Kira, then that’s what she wants to happen. So, she cooperates in investigating the new Kira, the power-hungry businessman.Since L has handcuffed himself to the concrete Light Yagami, they share the same fate (in the short term), and so Misa’s love for Light motivates her to help L as well.Marrying someone can be a way of controlling themThe greedy businessman with the Death Note, Kyosuke Higuchi, plans to marry Misa Amane. This is not just because she is beautiful, but because she is powerful, and he could use her power, especially her Shinigami eyes. After she is of use, he plans on taking a life insurance policy on her and killing her. As a former Death Note user who could regain her Death Note and memories, she is potentially very powerful, and a threat to him.Misa goes on a date with Kyosuke to gain information about him. She uses his desire to marry her to gain hard evidence that he is the third Kira.Ruling the world with a lover is enticingAfter Misa regains her memories, she takes the Shinigami deal again, further halving her lifespan. This is not just to kill L, but to create a new world with Light. The shared fantasy they have of ruling the world together is compelling and strengthens their relationship.People denigrate their other lovers to show their affection to a preferred loverKyomi Takada becomes the official spokeswoman of the new Kira, Teru Mikami. In college, Light had considered going out with her, but nothing came of it. Since Light would like to communicate with Teru, he starts dating Kyomi. Kyomi knows Light is dating Misa and brings this up. He explains that she’s not smart enough to be his partner. By denigrating the woman who he is dating, he opens up the possibility in Kyomi’s mind that she may date Light. His love has a preference ordering, and he is telling her that she ranks above Misa, being more likely to ultimately be his partner.People who are dating can communicate information secretlyOfficially, Light is investigating Kyomi. When he meets with her, the Kira investigation team is surveilling the conversation. Teru calls in, and Light explains to the investigation team that the surveillance has to be disassembled at Kira’s request. Once Light can speak privately with Kyomi, he explains to her that he is Kira, and that he would like to create a new world with her, with her as a goddess; this is similar to the fantasy he shared with Misa earlier.Later, instead of removing surveillance devices, Light has the meetings only audio recorded, and he and Kyomi pass notes. The context of dating enables more private communication, which is used illicitly.People who love the same person compete for their affectionKyomi requests a private meeting with Misa. Misa drinks a lot of wine. Kyomi notes that Light is busy and can’t see Misa often. This is a kind of posturing, showing she is more able to spend time with Light than Misa is; Misa is annoyed by this. Misa postures back by telling her that, at an upcoming pop festival, she will announce her engagement with Light. Kyomi keeps her cool and reacts positively, which confuses Misa. Misa worries Kyomi might have her killed by Kira, but Kyomi assures her that she won’t.Misa says she used to like Kira but doesn’t now that Light is trying to catch Kira, showing her un-awareness of the situation. Further, she says that when Light catches Kira, Kyomi will likely be executed. Kyomi reacts outwardly with shock, but inwardly with delight that Misa doesn’t understand that Light is Kira, indicating Light’s lack of trust in her. Kyomi cuts off the meeting, insulting Misa, who goes on to get more drunk. Afterwards, both think they have won the posturing contest to be Light’s girlfriend. Near, upon getting an intel report, concludes that Light is popular with the ladies and can get both Misa and Kyomi to do his bidding.Love can be fakedMisa’s plan to announce her engagement is cut off by her temporary detainment as part of Near’s investigation. Melo kidnaps Kyomi, but she kills him with a scrap of the Death Note. Both Light and Teru write Kyomi’s name in the Death Note, but Light does so first; he writes that she dies by burning everything around her. This ensures that the evidence of Kyomi’s possession of the Death Note, and information about her contacts with Teru and Light, is destroyed.Though Light appeared to love Kyomi and said they would rule the new world together, this was an empty promise. He faked love for her so she would trust him, and he could use and later betray her. Often, it is risky to take someone’s professions of love at face value.The death of a beloved can cause grief and suicideAt the end, after Light’s death, the anime shows Misa past a safety railing on a roof, hinting that she kills herself by jumping off. Because she loves Light so much, and she has said she couldn’t live without Light, it is in character for her to commit suicide after his death. As she said, she loves him more than the world.ConclusionIn Death Note, an unusually high portion of character decisions are instrumental, in a central conflict around the emergence of the Death Note on Earth. This enhances the degree to which character decisions can be interpreted game-theoretically; the inner monologues reveal further information about characters’ strategies.Love itself is not apparently strategic, but factors into strategy; it provides opportunities for trust, exploitation, information sharing, competition, and so on. In involving love with the central conflict, Death Note presents a more gamified conception of love and dating than are typical. By connecting relatively typical popular conceptions of love and dating to a great conflict, it reveals game-theoretic logic implicit in these popular conceptions. As such, analysis of love and dating in Death Note is a means of modeling real love and dating to some degree, albeit translated to the unusual context of an intense conflict involving supernatural powers.Models of love and dating gleaned from popular fiction will of course be simplified and culturally dependent, but it is socially relevant which sort of simplifications that people similar to the audience members understand, since in real interactions it is often unclear what aspects of love different people understand. The picture of love and dating one gets from Death Note is in which love involves obedience, sacrifice for the sake of the love interest, competition between different lovers over being the most preferred, private communication, the possibility of betrayal, and shared fantasies of ruling the world together.The entwinement of love and dating with strategic gameplay in Death Note creates intricate interpersonal dynamics, and it makes legible some of the more strategic aspects of love and dating. I think that’s part of what makes it so thrilling: it’s not simply a commentary on human emotion or on strategy, but a representation of their interactions and intersections."}
{"title": "Simple Kelly betting in prediction markets", "link": "https://unstablerontology.substack.com/p/simple-kelley-betting-in-prediction", "date": "2024-03-06T18:48:48.163Z", "content": "Kelly betting is a strategy for gambling, maximizing one's log(money) every round, by betting a fixed fraction of one's income. I will define Kelly betting a certain class of discrete prediction markets, give a simple Kelly betting rule for these prediction markets, and show it equivalent to the original Kelly formula in a two-outcome case.A prediction market consists of a finite set of outcomes O, and a probability measure Q(O) on these outcomes. Participants may buy, for some outcome o, a contract that pays out $1 if o comes true, for a price of $Q(o). This assumes no transaction fees.Suppose you have m money. You are going to spend all your money on these contracts, with R being a probability measure over O, and R(o) being the portion of money you spend on each type of contract. Note that you can buy some of each contract as an equivalent to holding on to money (e.g. to \"hold on\" to $2, buy 2 copies of each contract o, costing $2 in total; these contracts combined will always pay out $2). This means it's fine to assume that spending all your money on contracts doesn't compromise optimality.If your subjective probabilities of the outcomes are defined by a probability measure P(O), what is the optimal R(O) that maximizes your log-money at the end of this round?Your money conditional on outcome o is mR(o)/Q(o), since you are spending mR(o) on contracts costing Q(o) each. Therefore your expected log-money is:\\(f(R) := \\sum_{o \\in O} P(o) \\log \\frac{m R(o)}{Q(o)} = \\sum_{o \\in O} P(o) (\\log m + \\log R(o) - \\log Q(o))\\)Note that the log m and log Q(o) terms do not depend on R. We can therefore ignore these terms when taking the partial derivatives with respect to each R(o):\\(\\frac{\\partial f(R)}{\\partial R(o)} = \\frac{\\partial (P(o) \\log R(o))}{\\partial R(o)} = \\frac{P(o)}{R(o)}\\)If any of these partial derivatives are greater than any other, then expected log-money can be increased by moving a small amount of money from the outcome with the lower partial derivative to the one with the higher partial derivative (since f is continuous). Therefore, at the maximum of f, these partial derivatives all equal some constant c, i.e., P(o)/R(o) = c for some c. (Formally proving this might require some additional work, using the fact that f is concave and R(o) has to be positive whenever P(o) is positive; I'll omit this for brevity.)Equivalently, R(o) = P(o) / c. But this must imply c = 1, since R and P are both probability measures; any other c value would result in R not summing to 1. This implies R = P. What this means is that the optimal Kelly betting strategy involves spending a P(o) portion of your money on contracts paying out conditional on each outcome o.Interestingly, this is entirely independent of Q. This can also be seen by noticing that Q only contributes to additive terms in f that do not depend on R, such that the gradient does not depend on Q.Is this equivalent to the original Kelly rule in a two-outcome case? This rule is given by:\\(f^* = p - \\frac{1-p}{b}\\)where f* is the optimal portion of your money to bet, p is the probability of a win, and b is the ratio between how much is gained on a win versus how much is lost on a loss (e.g. on a triple-or-nothing coin toss, b = 2, because twice as much is gained on a win than is lost on a loss).We can set O = {w, l} (w is win, l is loss) and determine Q as a function of b. Specifically, we set \\(Q(w) = \\frac{1}{b+1} \\)\\(Q(l) = 1 - \\frac{1}{b+1} = \\frac{b}{b+1}\\)These are the implied house odds for b. If you spend x money on contracts paying out conditional on w, these contracts pay out x(b+1), corresponding to a net gain of xb money, whereas if you lose you simply lose x money; this therefore adequately translates b to a prediction market.Our rule says to spend a P(w) = p portion of your money on w contracts, and a 1-p portion of your money on l contracts. Suppose your starting money is m. If you win, your ending money is \\(\\frac{pm}{1/(b+1)} = pm(b+1)\\)If you lose, your ending money is\\(\\frac{(1-p)m}{b/(b+1)} = \\frac{(1-p)m(b+1)}{b}\\)Your loss upon losing is therefore:\\(m - \\frac{(1-p)m(b+1)}{b} = m\\left(1 - \\frac{(1-p)(b+1)}{b}\\right) = m\\left(1 - \\frac{(1-p)b}{b} - \\frac{1-p}{b}\\right) \\)\\(= m\\left(1 - (1-p) - \\frac{1-p}{b}\\right) = m\\left(p - \\frac{1-p}{b}\\right) = mf^*\\)As expected, when you lose, you lose a f* portion of your money. This is how much the original Kelly betting rule would lose upon losing. Therefore, in the 2-outcome cases covered by Kelly betting, our rule would agree.Why might this simple formulation be useful? The R = P formulation has given me greater intuition for Kelly betting and some ideas for how to extend it to more complex prediction markets. I find the formula a lot more intuitive, and its derivation more obvious, compared to the original Kelly betting formula."}
{"title": "A review of \"Don’t forget the boundary problem...\"", "link": "https://unstablerontology.substack.com/p/a-review-of-dont-forget-the-boundary", "date": "2024-02-08T23:14:03.973Z", "content": "IntroductionThis is a review of “Don’t forget the boundary problem! How EM field topology can address the overlooked cousin to the binding problem for consciousness”, by Andrés Gómez-Emilsson. This article seeks to address two problems with theories of consciousness, using an electromagnetic theory:The binding problem asks how a unified first person perspective (1PP) can bind experiences across multiple physically distinct activities, whether billions of individual neurons firing or some other underlying phenomenon. To a first approximation, the boundary problem asks why we experience hard boundaries around those unified 1PPs and why the boundaries operate at their apparent spatiotemporal scale.The binding problem is fairly easy to understand the basics of: it’s about how “our consciousness somehow binds multiple discrete features into a single unified awareness.” The boundary problem is elaborated on:At the same time, our consciousness does not “bind” features without limit—what we experience varies over time and is thus always strictly a subset of what could be experienced. There is an edge to our awareness, a boundary around us that is generally felt to exist at the human-scale of experience, rather than at the cellular or societal level.To me this seems not to be a problem with my preferred functionalist-ish theories of consciousness. A single brain mainly processes information from itself, and processes information from outside through fairly limited channels such as sensory perception. Therefore, it is unsurprising that no one experiences everything, because no one knows everything.One could speculate about there being super-entities, such as corporations, that have consciousness spanning many humans. This is not a major challenge to functionalism. If McDonalds experiences things its employees do not experience, it does not follow that any McDonalds employee writing papers about consciousness would report experiencing whatever McDonalds knows. That information is simply not present within the physical sub-system of the McDonalds employee writing a paper about consciousness.One can also speculate about the anthropic question of why we experience being a human rather than a corporation. Here a few things can be said:Some level of complexity of mind is required to be conscious in the relevant meta-aware sense (see HOT theories of consciousness).The information-transmission connections within a single brain are much denser than those between brains, making the brain a relevant relatively-independent unit of mind.While some social structures may know things comparable to a human, this is not at all clear (especially because of the low bandwidth between humans within a social structure), and even if true, the number of such structures possessing meta-knowledge comparable to a single human is low compared to the number of humans, such that is unsurprising, anthropically, to not be one of them.Andrés does take issue with functionalist theories dealing with the boundary problem, however:For instance, information or causality driven solutions to the binding problem, e.g., functional or computational theories of mind (discussion in Gómez-Emilsson and Percy, 2022), might define phenomenal binding as occurring when two items interact causally or are associated with each other in a database. The challenge is that there is no neat boundary where the causal interactions or informational associations should stop—the solution over-delivers and everything ends up bound together.I believe what I’ve already written is mostly sufficient to address this criticism. I do, however, think there are details to be worked out, in line with Andrés’s statement that “in a continually changing, interacting environmental topology of connectivity strengths, it is necessary to address the challenge of separating systems from subsystems in a disciplined manner, particularly if a hard boundary is desired.” While the dense informational connections within the brain are an important feature, a mathematical theory is not worked out.Much of what Andrés seeks to address is the relation between conscious discreteness and physical continuity: “the wheel regarded as a wheel is discrete, but regarded as a piece of matter, it is continuous.” I’ve written before about the difficulties of continuous theories such as many-worlds explaining discrete observers and observer experiences, and some physicists such as Jess Reidl have tried working out the problem of deriving discrete branches from the continuous Schroedinger equation.To get simpler than many-worlds, one may consider identifying discrete features in the state of a dynamical system. For example, consider a sinusoidal hills-and-valleys system defined as dx/dt = sin(x). The x values for which sin(x) = 0 experience no change over time. However, x=0 is unstable (x slightly higher than 0 will tend to increase, and x slightly lower than 0 will tend to decrease), while x=pi is stable, and is an attractor. Thus, almost all x values will fall into one of the “valleys”, corresponding to the integers.One could also consider implementing a finite state machine with a dynamical system. The dynamical system can be divided into regions, where a point in one region either stays in that region or goes to one of some set of other regions. The evolution of the point over time would therefore be predicted by a deterministic or non-deterministic finite state machine (assuming the number of regions is finite).Electronic computers must implement digital signals on an analog substrate, e.g. using analog-to-digital converters, ensuring that continuous states fall within a discrete set of regions that behave according to discrete dynamics over time. The general theory of factoring a dynamical system into a discrete set of states that evolve over time is, however, underspecified, at least to my knowledge.Electromagnetic theories of consciousnessElectromagnetic theories of consciousness come up in the problem of demarcating individuals:Fekete et al. (2016) suggest a solution, asking researchers to look for properties that offer a principled mechanism for singling out intrinsic systems, demarcating systems as a matter of fact rather than being a matter of interpretation from different observers’ viewpoints. Later discussions in this section on phase transitions and the field topology in section “4. Topological segmentation of EM fields as a resolution direction” are suggested as examples of such intrinsic mechanisms.To me this seems to be jumping to conclusions. While the boundaries of what constitutes a mind are imperfect (since brains interact with, and are part of, the rest of the world), and under-defined, it does not follow that electromagnetic connections are the only relevant ones to pay attention to. One can imagine, for example, building a mind out of mechanical components such as rolling balls.This suggests that information processing can happen without electromagnetism. On the other hand, electromagnetism can happen without information processing. One could imagine a lot of brains that are connected with each other, but only in ways that are irrelevant to the functioning of core systems controlling sensory input, behavior, memory, and so on. For example, the brains may relay information between each other that gets processed by a pseudorandom number generator and fed back in as a source of noise (to the extent that the brain, algorithmically, utilizes noise for its functioning, which seems likely). These electromagnetic connections would be irrelevant (compared to “default” noise generators) with respect to the functioning of mental sub-systems corresponding to memory, motor control, and so on.Electromagnetic connection, like IIT, may be a good proxy for consciousness in the empirical world (such as by labeling individual brains as discrete entities), but the theory is not robust to very different situations.Andrés repeatedly mentions larger-scale conscious entities than humans as a problem for theories: “It is possible that all nested levels of resonance represent separate levels of consciousness, as Hunt (2020) suggests, but then we must explain why the human experience is so consistently at the meso level.”). As before, I emphasize that, even if such larger conscious entities exist, this would neither imply that humans experience the experiences of these larger entities, or that anthropic observers are likely to be them.EM theories may have problems with explaining why humans do not experience each others’ experience:A closer discussion of boundary problem issues comes in Jones (2013) discussion of how EM fields can be consistent with mental privacy, e.g., no telepathy even when our brains are close together such that some of the EM fields might overlap or merge. His solution is to identify consciousness of the relevant scale only in highly localised fields, unlike for instance the larger, more brain-wide fields of McFadden’s ToC. By requiring more local, stronger fields created in ion currents, the rapid decline in EM field strength with distance is sufficient that nothing gets past the boundaries of the physical brain and thus into telepathic territory. This perhaps resolves the “macro” side of Rosenberg’s problem, but not the “micro” side. There must be many candidates for boundaries within the brain that enclose sufficiently strong EM fields; why does it appear—at least most of the time—that we only experience one? Which one is it and why?The difficulty of telepathy is broadly explained by conventional theories of mind, which emphasize that the brain processes information from a limited set of channels, such as eyesight and hearing. Whether or not additional multi-human observers exist in some ontological sense, they aren’t relevantly in control of human motor functions.This is not such an issue for functionalism, which can note that core mental sub-systems of humans, such as memory, do not receive information from nearby other humans, except through a limited set of sensory channels. The segmentation comes from the identification of a set of connected mental functions, with information-theoretic connections rather than electro-magnetic connections being the primary object of attention.The addition of a locality factor seems rather ad-hoc, and like it would fail to generalize to minds that span across space. One could imagine an alternative universe where evolution created organisms that use something similar to WiFi to produce minds that span across space. Functionalism would say that, given the informational connections, the distance is irrelevant, while the locality factor would exclude these connections. In that alternative universe, would EM theorists of consciousness have suggested not including a locality factor, so as to continue believing that their space-spanning consciousness exists?In general, I do not consider the possibility of group consciousness to be a major problem for theories of consciousness; as stated before, the existence of a group consciousness does not imply that any member of that group would have experience/knowledge corresponding to that group consciousness. The problem is more in taking individual minds with dense connections (e.g. a single brain, or perhaps a brain hemisphere) to be minds, and not blowing up the number of minds too badly for anthropic purposes.Five boundary problemsAndrés goes on to discuss five different sub-problems of the boundary problem: the hard boundary problem, the lower-levels boundary problem, the higher-levels boundary problem, the private boundary problem, and the temporal boundary problem.The hard boundary problem “observes that our phenomenal field, or our first person perspective, appears to be enclosed by a firm, absolute boundary. There is a qualitative difference between the things that enter that phenomenal field and things that do not”. This seems to be an odd formulation. A theory of consciousness should say something about what different minds experience. It is implicit in having a theory of consciousness at all that not everything is experienced. To the extent that the brain utilizes something like analog-to-digital converters, an analog signal must be strong enough to be picked up as a digital signal (e.g. a neuron firing; neurotransmitters are discrete molecules). A memory sub-system, such as the hippocampus, has a limited space (perhaps corresponding to bits, perhaps not) with which to store information.The lower-levels boundary problem is about why consciousness is not at a low level of physical abstraction: “consider an alien observer who does not rely on photons to construct a model of the outside world, but instead relies solely on senses of sound waves or gravitational waves. The boundaries of the human system relative to the lower/higher levels around it no longer necessarily look as unique.” The functionalist answer is that, below a certain level of abstraction, not enough mental sub-systems (such as memory and higher-order thought) are implemented. However, there could still be functionalist micro-consciousnesses, e.g. brain hemispheres, that do implement these mental functions. This is not a huge problem for that theory, as these consciousnesses would not control human behavior in the relevant direct sense for writing about consciousness to be from their perspectives.The higher-levels boundary problem is similar, about why our experience is not of larger minds, and has already been discussed.The private boundary problem is about why we do not experience what others experience, and has likewise already been discussed.The temporal boundary problem is about how experience is constituted over time: “The temporal binding problem asks how the moments are knitted together over time to feel like part of the same experience. The temporal boundary problem asks how, once we have a boundary around a static experience or a particular moment of 1PP, that boundary can shift mostly contiguously to have different shapes in future moments”. It seems to me that the emphasis in answering this question must be on memory sub-systems of the brain, which do the task of knitting together experience over time, and focusing on other levels of abstraction, such as EM fields, would fail to match reports of experience, e.g. by assuming there is more connection in experience over time than would actually be remembered and reported on.Topological segmentation of EM fieldsAndrés discusses how these problems may be resolved with field topology. Field topology is about what one would expect from the name: “Field topology refers to the geometric properties of an EM field object that are preserved under continuous transformations, such as stretching, bending, or twisting”. This can be used to find patterns in the electromagnetic fields of the brain.Some features of EM fields prevent field transmission under some circumstances: “Closed EM structures with certain durations can be understood as enclosing electromagnetic space so as to temporarily prevent the transit of energy with that same EM spectral range outside of the space”. These enclosures may affect the field topology.EM theories of consciousness may deal badly with special relativity, to the extent that they assume a naive notion of simultaneity: “To the extent proposed consciousness generating mechanisms rely on synchronicity or in-phase frequencies at different locations (necessary if they are to resolve the binding problem between those locations, for instance), those consciousness would not be bound together from the perspective of anyone in any reference frame moving relative to the first”. Topology may, on the other hand, be relatively unaffected by this, having Lorentz variance.Andrés discusses epiphenomenalism: “Epiphenomenalism… is the weaker claim that the 1PP experience is a by-product of particular physical processes in the human system that does not directly causally interact with those particular processes.” On the general understanding that consciousness theories look at a physical system and identify observers within it, it is hard to avoid these “observers” being epiphenomenal, as one is imagining identifying observers “after” a physical system is already defined and in motion. I believe alternative views of consciousness, such as ones where first-person experience is intrinsic to the constitution of physics theories (hinted at in a previous review, some background discussed in a previous article), may shed more light on epiphenomenalism.Andrés believes EM theories may avoid epiphenomenalism: “In other words, EM fields are not merely a side-effect of electrical activity in the brain, but in fact influence the activity of individual neurons and their parts”. It seems that, by identifying consciousness with a physical property, consciousness would have physical effects. This is not unique to EM theories, however. For example, a functionalist could identify consciousness with a high-level property of a physical system, implying that if consciousness were different, then the physical system would behave differently; e.g. if bits in a computer register were different, then the computation and subsequent physical output of the computer would change.How might topological EM theories address the boundary problem? Regarding the first problem: “The complexity of the contents of unified experience, i.e., often containing multiple shapes or features, is explained because the field contains all the information of the EM activity that gives rise to it, including computational insights and assessments from relevant diverse brain modules operating via a neuronal architecture”. It seems that, while EM fields are more unified than, say, individual neurons, they still don’t contain the entire information processing of the brain, e.g. neurotransmitters. It is the system of EM fields and other parts (like neurotransmitters) that implements the set of mental functions, such as memory, that is causal in reports about conscious experience.Regarding the second and third problems: “The second and third problems are resolved by accepting all well-bounded 4D topological pockets to have their own 1PP, potentially of a very rudimentary and short-lasting nature. Depending on the mechanisms involved, there may be dozens or billions of these in any one system, both smaller than and larger than the meso-level humans typically experience and discuss with each other.” I agree in that it is not a huge problem for a theory of consciousness to accept conscious entities at different levels of abstraction than human minds. However, multiplying the number of conscious entities too much may create problems for anthropics, as one would expect to “probably be” a lower-level entity if there are many of those.Regarding the fifth problem: “Of all the well-bounded 4D topological pockets that might exist in the brain, we suggest that only one of them bounds a field that encloses (and hence integrates) EM activity emerging from the brain’s immediate memory modules”. EM fields exist across space and time, hence being 4D. It is correct to focus on the brain’s memory modules, as those are what has the computational power to bind experience over time. However, if one is accepting “memory modules” as a well-defined unit of analysis, it is unclear why adding EM fields helps, compared to looking at information transmission between the memory module and other computational modules.Regarding the forth problem: “The merging of two 1PPs into a single 1PP is only a relevant question for a single 4D pocket in any case, existing for a very short period of time. This may be possible in principle but extremely difficult, since any attempt to bring the necessary modules close enough would likely destroy the physical mechanisms that generate a pocket with the right hard boundaries to enclose a 1PP with any temporal persistence (even microseconds).” I don’t have much to say on the physics of this. It seems that a group mind would by default fail to have its own memory sub-system, and one can analyze entities that have memory by studying connections of the memory sub-system to whatever other systems it is connected to, whether they are in the same human brain or not.ConclusionOverall I’m probably not the target audience for this article. It seems to be intended for people who have already rejected a functionalist theory of consciousness and are looking for a theory that explains consciousness in terms of relatively low-level physical properties of systems, such as EM fields. The article details problems with EM theories and how topology may ameliorate these problems, but is more suggestive at an area to look for solutions than a proposal in itself (as it acknowledges).There is a way in which much of the theory-building discussed in the paper is “working backwards”: it’s looking at high-level experiences which closely resemble reports of consciousness, and seeking to find low-level physical entities which have properties corresponding to these entities. The problem is that, if you are trying to do something like “curve fitting” on experiences that closely resemble human reports about experience, there will be many epicyclic contortions to get these to match up (such as the locality criterion), if one is not trying to make one’s explanations match up with the actual causal chain that produces reports of consciousness.If one is seeking to explain reports of consciousness, understanding the functioning of the mind and brain is a cognitive science problem that is not especially metaphysically difficult. If one is seeking to define a metaphysical entity of “consciousness” that need not match these reports, but could be used in anthropics, one can do metaphysical study of consciousness. But EM theories seem to be trying to do both at the same time: they’re trying to find a metaphysically sensible entity corresponding to “consciousness” which corresponds to empirical reports of consciousness, without paying much attention to the multi-layered system that generates reports of consciousness.Attending primarily to the functioning of this system would by default lead to a functionalist theory of consciousness: it is very unsurprising, for example, that the functioning of the mental human sub-systems do not have access to telepathic information. However, one runs into problems when using metaphysical considerations to select consciousness-bearing entities such as EM fields, while also trying to match human reports of conscious experience.As such, I don’t find this overall line of research to be all that useful or compelling, and remain mostly a functionalist who thinks about the first-personal metaphysics of science to supplement theories of consciousness."}
{"title": "Liberals are bad at BDSM", "link": "https://unstablerontology.substack.com/p/liberals-are-bad-at-bdsm", "date": "2023-10-06T18:58:58.060Z", "content": "It seems like quite a lot more people are kinky these days than they used to be, even 10 years ago. “Kink” is itself a rather ambiguous category, encompassing both unusual sexual interests that are genuinely erotic (in the sense that they involve genital stimulation and/or other forms of stimulation that increase the level of arousal that leads to orgasm if taken to a sufficiently high level), as well as dominance behaviors that have little to do with eroticism. The category “BDSM” more directly points at dominance-related behaviors.It’s to the point where, rather than BDSM being a niche interest, it’s hard, within at least some social bubbles, to find sexual partners who do not prefer, or even require, BDSM. This is, to particular individuals who do not wish to engage in BDSM but do wish to have sex, inconvenient, although without more details, complaining about it would amount to the incel-adjacent complaint of “people don’t want to have sex with me unless I meet some conditions I do not want to meet.”The particular details are, though, important. One has to wonder, “why do all these submissives keep subbing to me?”. There is a naïve, liberal picture of BDSM, in which individual persons are interpreted as having unusual sexual preferences, analogous to other preferences (such as preferences for particular sex acts), and these preferences happen to be for pretend dominance behaviors, which are pretend in the way that acting is pretend (and in particular, improv; BDSM is usually more improvised than scripted, and the book “Impro” discusses status dynamics, a core part of both improv and BDSM).Someone taking this view would, in practice, be bad at BDSM. The unusual preferences are not entropic deviations from a central tendency of normal sex (as the word “paraphilia” implies), but rather, deviations from central-case sex in a particular direction that involves dominance behaviors. While BDSM can involve the erotic, most is not inherently erotic; it is not the sort of activity that would efficiently produce stimulation of the genitals or similar sensations to those. Some people with little interest in sex, such as asexuals, are still into BDSM.What seems to be happening is that people are labeling dominance behaviors as “sex”, but these behaviors are for the most part not actually erotic if one thinks critically about them, and the notion of entropic deviation from normal sexual preferences (paraphilia) is used to explain these deviations, and justify them in the framework of liberal sexual choice. One would not, in general, apply this sort of labeling to other primates; it would be easy to distinguish dominance from sex.An important deviation from the liberal picture of BDSM is that liberal individual preferences are well-modeled as microeconomic, and BDSM preferences are not. Under microeconomics, agents generally desire to have more options, although there are some necessary constraints in terms of respect for others’ property and so on. BDSM submissives, however, seem to in some ways prefer to have options taken away, such as by being tied up. (While this could be explained in a number of ways, one relatively compelling explanation is that they feel themselves to already be under coercion, and prefer for that coercion to be concretized.)In a liberal economy, agents voluntarily agree to constraints (such as the constraint of working as a waiter and serving people), and in exchange they gain money, which they can use to purchase, among other things, services from other people who become temporarily constrained so as to render these services (e.g. a waiter purchasing coffee).In a BDSM context, those who take on constraints do not thereby gain a currency they can use to cause others to temporarily take on constraints so as to better satisfy their preferences; rather, people are sorted into “dom” and “sub” classes, so taking on constraints now is correlated, rather than anti-correlated, with taking on constraints in the future; this is a better match for a caste system than an economy.Eliezer Yudkowsky’s fiction piece, “Dark Lord’s Answer”, features an expert macroeconomist who is also an extreme BDSM submissive. This combination of macroeconomics with BDSM at first seems rather random, but I suggest that it is an aesthetically appropriate combination. Macroeconomics relates to military mobilization, and operates on cybernetic principles that attempt to control unemployment and inflation, causing people to have to keep working whether or not there’s anything to do, as if they’re being dommed. Although the relationship between economics and BDSM is rather complex, I have heard that more women became kinky after the 2008 financial crisis, which matches my model of the relation between macroeconomics and BDSM. (Eliezer Yudkowsky’s “Planecrash” series, which I haven’t read, goes into a lot of detail of how BDSM behaviors may be connected to one’s interpretation of one’s social situation, or so I’ve heard.)A more subtle point is that, above contradicting microeconomics, BDSM contradicts individualism itself. BDSM can involve non-individualist states of consciousness, for example, in hypnosis. The yearning to be someone’s slave is, rather than the yearning to be an autonomous individual, a yearning to be a component in a larger social system. BDSM can be linked to shame (through, for example, humiliation), which triggers non-individualist mental states, in feeling watched by an intrusive “big Other” whose perspective is not the perspective of any individual human, and which has the power to make you “valid” or “invalid”. The common social justice phrase, “you are valid!”, is creepy not so much in what it expresses directly as in what context it assumes, in which persons can be made “valid” or “invalid” on the basis of their “identity” and social/coalitional interpretations of them.The trappings of BDSM, such as whips and chains, are not random “fetishes” that people are into. If hearing the phrase, “man ties up woman and has sex with her”, the first two available interpretations are rape and BDSM. Since rape preceded BDSM, a natural assumption is that BDSM often imitates rape; this happens explicitly sometimes (consensual non-consent, or CNC), but even BDSM that is not overtly CNC usually has the aesthetics of sexual assault or torture.Again, the liberal kink advocate will say, this is individuals making informed decisions to satisfy their idiosyncratic preferences, it’s not rape even if it kinda looks like that. That still raises the question, why do these things look like sexual assault and torture? What’s going on with psychological states that prefer the trappings of these things?If one doesn’t understand BDSM through an illiberal lens, one will be bad at BDSM. To satisfy subs, it can be important to understand the way in which people feel they live under concealed threats and can be more comfortable if the coercion they experience is more concrete and obvious.  If the deviations from central-example sexuality are in the direction of subs wanting to be pretend-raped, rather than being entropic, then the easiest way to satisfy a typical BDSM submissive will be to pretend-rape them, ideally with some sort of method acting for sufficient realism. Method acting rape, unfortunately, trains one’s mind to do that sort of thing, by convincing some part of the mind that it’s real, so as to act sufficiently realistically. It is “unvirtuous”, in the Aristotelian sense; it trains bad habits. (Plato’s Gorgias, additionally, had the character Socrates say that it is better to suffer injustice than to commit injustice, pointing at a way in which domming willing submissives isn’t a free lunch, if the context of this domming is unjust.)As a test of whether liberal assumptions are being followed, if there is a BDSM contract that involves a CNC scene, and the dom does something during the scene that upsets the sub, and the sub later accuses the dom of sexual assault or abuse, do people check whether the contract was actually followed? If so, then plausibly the community is implementing liberal assumptions about freedom of contract. If not, then a primary effect of BDSM contracts is to create a gray area where sexual assault is more acceptable than usual, and whether the behavior is considered acceptable is based more upon the illegible power dynamics of the situation than on the specific behaviors and agreements that in fact happened, as rule of law would require. (In my experience, I have never seen communities dealing with BDSM sexual abuse accusations check whether the actual contracts were followed, and my impression is that the law typically does not respect these contracts.)I have heard at least one BDSM sub say (paraphrased) “yeah, basically an actual rape is taking place, and you beforehand agreed to have this happen, because you expected to enjoy being raped”. This perspective, that of someone actually considering and making the decision, is rather different from the idea that the coercion is entirely fake, which is used to justify BDSM. (To be clear, I don’t find the sub’s perspective entirely unrelatable.)Perhaps a short summary is that BDSM culture imitates rape culture. Rape culture is a phrase that is confusing to the un-initiated, but can be understood partially from life experiences encountering it. It refers to a culture that, routinely, allows and even expects rapes to happen, covers these up, perpetuates myths such as “love cannot happen without coercion”, and so on. Certain institutions, such as typical psychiatric institutes and prisons, can be documented to have high rates of rape, although the more sociologically interesting fact is that there are similarities between such high-rape cultures and more general, out-in-the-open cultures.If BDSM culture imitates rape culture, that doesn’t automatically imply that it is rape culture. But the imitation implies that, when BDSM is normalized, it is harder to distinguish rape culture from non-rape sexual culture. What would typically be considered signs of severe abuse can be, alternatively, interpreted as voluntary BDSM behaviors, if not checking in more detail. (Someone once joked to me about how he had bruises from his boyfriend beating him up, which is funny due to this ambiguity).The Jewish law concept of marit ayin is relevant here. If something is not itself a violation of Jewish law, but would appear to onlookers to be one, then it is not allowed under marit ayin. Perhaps this is partially because it becomes harder for norms to be respected and enforced if there are a lot of apparent norm violations around. Similarly, it becomes harder to enforce norms against abusive relationships if there are a lot of apparent (even if not actual) abusive relationships around.Sexual abuse happens in BDSM communities, like in other communities. The difference is that BDSM makes what constitutes abuse or a consent violation rather more subtle; simply ignoring a person saying “no” does not constitute nonconsensual behavior in a BDSM context, as there may have been a safeword set up. Therefore, what has to be judged is what the safeword was and whether it was ignored, which is higher-context, analogous to “parsing nested ‘quotation’ marks”. There is no way to, aesthetically, judge sexual assault by the “I know it when I see it” standard in a BDSM context, as BDSM adopts the aesthetics of sexual assault while differentiating itself from sexual assault by technicalities such as safewords. It is harder for a community to judge whether sexual assault even happened, since even video evidence is insufficient; there may have been a negotiation previously off-camera. It seems only doable with a system of technical pseudo-lawyers that judge independently of the normal legal system.I know about BDSM, and I know about trauma behaviors, and I can’t help but notice the similarity. It’s hard to think of BDSM as some random stuff people are into, when the overlap, at least at a surface/aesthetic level, with trauma is so strong. Sexually traumatized people (especially women) often try to find partners who will control and rape them in relatively predictable ways, and BDSM relationships can look like this with an extra layer of pre-negotiation and safewords. Traumatized people tend to side with aggressors, and BDSM submissives will prefer relationships with people displaying certain forms of aggression. Abusive partners will often try to “own” their partner, and BDSM relationships can involve such “ownership” at least narratively (even if not meta-narratively). And, lo and behold, Aella finds a correlation between BDSM interest and having experienced sexual assault.I can empathize with wanting to be physically constrained, since I’ve had the experience of psychotically believing that I was causing great damage to the world through fairly subtle motor actions, and wanting to be in a jail cell or similar. In a state of shame, it can be relieving to be deprived of freedom, so as to assure one’s self and others that the harm one can cause is limited. I think BDSM and trauma, as psycho-social phenomena, generally involve similar, illiberal, non-individualist mental states, since I’ve experienced some of both.Again, someone who didn’t at some level understand this would be bad at BDSM. I don’t think the things I am saying are entirely obvious, but I think they (or at least, largely similar explanations) are pretty obvious conditional on understanding BDSM well enough to be any good at it. What if part of what’s going on is that traumatized people are looking for relationships that have a lot in common with the sort of high-violence relationships they would normally seek, but have enough aspects of normal consent to reduce potential problems including policing by a broader community? That would seem to explain a high fraction of cases, though not all of them.There is some research indicating that BDSM may help traumatized individuals recover from trauma, but, still, this implies that BDSM is related to trauma and its popularity may indicate widespread traumatization. I don’t find it unlikely that BDSM could help process trauma (I think I have done at least some of this), I just think that, to the extent that it helps, it’s because trauma and BDSM engage similar mental states, and preferences for BDSM aren’t random paraphilias.Other than trauma, there are other explanations. For one, talking about kink is, somehow, more socially acceptable than talking about sex directly, especially weird sex. It seems more socially odd to say you’re into, say, fisting, compared to saying you’re into whipping people. This seems like a rather suspicious set of social norms. Pointing to tolerance for BDSM as evidence for tolerance of strange sexuality (“kink” or “paraphilia”), and therefore sexual liberation, is, accordingly, suspect if not coupled with tolerance of unusual intrinsically erotic behaviors.This is still pointing at a general cultural problem of sexualized power dynamics, but isn’t so much about traumatized individuals as the culture itself. I think it is, accordingly, overly broad to say BDSM is always traumagenic, although perhaps it is in the typical case. At least, it’s hard to explain why BDSM might grow to being a majority preference without changing cultural factors at play. Another cultural factor is the domestication of humans. If most humans are domesticated, that raises the question of whether there is a class of human-domesticators, and how humans might recognize them. The BDSM dom seems to, in some ways, behave similarly towards the sub as an animal handler would behave towards a domesticated animal (for example, whips and chains are used on both humans and horses; it’s even more explicit in petplay), which may appeal to whatever intuition in domesticated humans is looking for the domesticator class.There is at least some BDSM that legitimately seems like it could be enjoyed without engagement with trauma. For example, wrestling people in bed can be a fun adversarial sexualized game; it can be fun for some of the reasons regular wrestling is fun and sex is fun. My point is not so much that this entire category of thing is bad so much as that the statistical pattern of behavior indicates things being wrong in the culture.I’m not really trying to condemn people from a high horse here; this is about non-individualistic systems that create incentives on individuals (and entrain people into non-incentive-based behaviors), much more than it is about the choices of individuals. “Kinkshaming” seems to come mostly from conservatives who think enforced monogamy is great. I think enforced monogamy and BDSM have the same problem, of displacing eroticism with systems of domination, and one could have reasons for preferring either one to the other given lack of other options.The freedom to submit is a paradoxical sort of freedom, recalling the riddle, “can God create a rock so heavy even He cannot lift it?”. People can claim to be “liberated” by kink, but what does that mean, if the relevant liberty is liberty to adopt chains? What would it even mean for the practice of dominance itself to be liberated? I think someone could come up with a galaxy-brained take about how, really, BDSM can liberate people despite the paradoxical constraint, but, isn’t the most straightforward interpretation of “BDSM” that BDSM practitioners aren’t seeking to be liberated in the first place?"}
{"title": "A review of Principia Qualia", "link": "https://unstablerontology.substack.com/p/a-review-of-principia-qualia", "date": "2023-06-29T06:06:43.139Z", "content": "Principia Qualia, by Michael Johnson, is a long document describing an approach to theorizing about and studying consciousness. I have heard enough positive things about the document to consider it worth reviewing.I will split the paper (and the review) into 4 parts:Motivating bottom-up physicalist consciousness theoriesReviewing Integrated Information Theory and variantsSpecifying the problem of consciousness and valenceSymmetryI already disagree with part 1, but bottom-up is still a plausible approach. Part 2 makes sense to pay attention to conditional on the conclusions of part 1, and is basically a good explanation of IIT and its variants. Part 3 describes desiderata for a bottom-up theory of qualia and valence, which is overall correct. Part 4 motivates and proposes symmetry as a theory of valence, which has me typing things like “NO PLEASE STOP” in my notes document.Motivating bottom-up physicalist consciousness theoriesThe document is primarily concerned with theories of consciousness for the purpose of defining valence: the goodness or badness of an experience, in terms of pleasure and pain. The document motivates this in terms of morality: we would like to determine things about the consciousness of different agents whether they are human, non-human animal, or AIs. The study of valence is complicated by, among other things, findings of different brain circuitry for “wanting”, “liking”, and “learning”. Neural correlates of pleasure tend to be concentrated in a small set of brain regions and hard to activate, while neural correlates of pain tend to be more distributed and easier to activate.The methods of affective neuroscience are limited in studying valence and consciousness more generally. Johnson writes, “In studying consciousness we’ve had to rely on either crude behavioral proxies, or subjective reports of what we’re experiencing.” The findings of affective neuroscience do not necessarily tell us much about metaphysically interesting forms of valence and consciousness (related to Chalmers’ distinction between easy problems of consciousness and the hard problem of consciousness).Johnson defines top-down and bottom-up theories, and motivates bottom-up theories:There are two basic classes of consciousness theories: top-down (aka ’higher-order’ or ’cognitive’ theories) and bottom-up. Top-down theories are constructed around the phenomenology of consciousness (i.e., how consciousness feels) as well as the high-level dynamics of how the brain implements what we experience…However, if we’re looking for a solid foundation for any sort of crisp quantification of qualia, top-down theories will almost certainly not get us there, since we have no reason to expect that our high-level internal phenomenology has any crisp, intuitive correspondence with the underlying physics and organizational principles which give rise to it…Instead, if we’re after a theory of valence/qualia/phenomenology as rigorous as a physical theory, it seems necessary to take the same bottom-up style of approach as physics does when trying to explain something like charge, spin, or electromagnetism.If our high-level phenomenology has no “crisp, intuitive correspondence with the underlying physics and organizational principles which give rise to it”, it’s unclear why a bottom-up theory would succeed either.To explain my take on this, I will first explain how my motivation for studying consciousness differs from Johnson’s. Johnson is primarily concerned with identifying conscious agents experiencing pleasure and pain, for the purpose of optimizing the universe for more pleasure. I am primarily concerned with consciousness as a philosophical epistemic and ontological problem, which is foundational for other study, including physics itself.Which brings me to my main disagreement with bottom-up approaches: they assume we already have a physics theory in hand, and are trying to locate consciousness within that theory. Yet, we needed conscious observations, and at least some preliminary theory of consciousness, to even get to a low-level physics theory in the first place. Scientific observations are a subset of conscious experience, and the core task of science is to predict scientific observations; this requires pumping a type of conscious experience out of a physical theory, which requires at least some preliminary theory of consciousness. Anthropics makes this clear, as theories such as SSA and SIA require identifying observers who are in our reference class.I believe, therefore, that whatever theory we get of consciousness at the end of getting a physical theory should self-ratify by labeling the scientific observations used to form this theory as conscious experiences, and also labeling other analogous experiences as conscious. My own critical agential theory of free will and physics, itself similar to (though invented independently of) constructor theory, is a start to an approach to studying physics starting from an egocentric perspective (therefore, top-down) that can self-ratify by locating itself within its discovered physics, and consider its actions (and therefore its observations) to not be epiphenomenal.If our high-level phenomenology has no “crisp, intuitive correspondence with the underlying physics and organizational principles which give rise to it”, it’s unclear why a bottom-up theory would succeed either for the purpose of predicting our high-level phenomenology, which is a core objective in my approach. It would seem that we need to move through many layers of abstraction in the stack, from psychology to neuroscience to chemistry to physics. I broadly agree with functionalism (even though I have some objections), so it seems to me that explaining these different abstraction layers, in a way that admits to alternative foundations of a given layer (therefore, allowing studying consciousness in alternative physics), is critical to understanding the relation of consciousness to physics. For a general argument as to why consciousness can be multiply realized, see Zombies! Zombies? and The Generalized Anti-Zombie Principle. (Johnson would consider functionalism a top-down approach.)So, given that my ontology of science and consciousness is different from the authors’, it’s not surprising that I find their overall approach less compelling; however, I still find it compelling enough to look a the implications of taking a bottom-up approach to studying consciousness.Reviewing Integrated Information Theory and variantsJohnson writes: “For now, the set of bottom-up, fully-mathematical models of consciousness has one subset: Giulio Tononi’s Integrated Information Theory (IIT) and IIT-inspired approaches.”IIT defines a metric Φ on information states of a system, which is designed to measure the consciousness of that state. It is designed to rule out various trivial information processing systems that we would not attribute consciousness to, including states whose information is overly correlated or overly uncorrelated.Johnson continues: “Tononi starts with five axiomatic properties that all conscious experiences seem to have. IIT then takes these axioms (‘essential properties shared by all experiences’) and translates them into postulates, or physical requirements for conscious physical systems – i.e., ‘how does the physical world have to be arranged to account for these properties?’ (Tononi and Albantakis 2014).”IIT implies there may exist multiple “minimum information partitions” within a single brain, indicating multiple conscious entities; Tononi accepts this conclusion. This seems reasonable to me given that a great deal of mental processing is not conscious to the same conscious entity that writes words such as these, and this processing could indicate consciousness of a different sort.The paper goes on to discuss criticisms of IIT. Among the most important are:There is no formal derivation of Φ from the postulates.“Griffith is clear that the mathematical formula for Φ, and the postulates it’s nominally based on, have been changing in each revision.”“Griffith echoes a common refrain when he notes that, ‘As-is, there has been no argument for why the existing axioms of differentiation, integration, and exclusion fully exhaust the phenomological properties requiring explanation.’”“Indeed, Aaronson identifies a simple-to-define mathematical structure called an ‘expander graph’ which, according to the math used to calculate Φ, would produce much more consciousness than a human brain.”It’s unclear what information connection structure to feed into Φ, e.g. should it be a map of which neurons are activated, or take other information into account?“As noted above, Tononi has argued that “in sharp contrast to widespread functionalist beliefs, IIT implies that digital computers, even if their behaviour were to be functionally equivalent to ours, and even if they were to run faithful simulations of the human brain, would experience next to nothing” (Tononi and Koch 2015). However, he hasn’t actually published much on why he thinks this.”Johnson goes on to summarize and review two alternative IIT-like theories: Perceptronium and the “field integrated information hypothesis” (FIIH).Tegmark’s Perceptronium theory attempts to define consciousness in terms of, rather than information states, quantum interactions. He is interested in this as part of an anthropic theory to solve the Quantum Factorization Problem, the problem of why we observe some factorizations of a quantum system but not others.Adam Barrett’s FIIH defines consciousness in terms of a quantum field. He argues that electromagnetic fields are the only ones capable of supporting consciousness, as gravity and strong and weak forces don’t support enough complexity. However, he doesn’t present a formal theory.Specifying the problem of consciousness and valence.Johnson considers IIT inadequate, but worth building on. (I don’t consider it worth building on; see previous points about bottom-up approaches). He lists eight problems to solve, grouped into three categories:Step 1 (metaphysics) breaks down into two subproblems:1. The Reality Mapping Problem: how do we choose a formal ontology for consciousness which can map unambiguously to reality?2. The Substrate Problem: which subset of objects & processes in our chosen ontology ‘count’ toward consciousness?Step 2 (math) breaks down into four subproblems:1. The Boundary (Binding) Problem: how do we determine the correct boundaries of a conscious system in a principled way?2. The Scale Problem: how do we bridge the scale gap from our initial ontology (e.g., the Standard Model, string theory, individual computations, etc) to the spatial and temporal scales relevant to consciousness?3. The Topology of Information Problem: how do we restructure the information inside the boundary of the conscious system into a mathematical object isomorphic to the system’s phenomenology?4. The State Space Problem: what is ‘Qualia space’? – I.e., which precise mathematical object does the mathematical object isomorphic to a system’s qualia live in? What are its structures/properties?Step 3 (interpretation) breaks down into two subproblems:1. The Vocabulary Problem: what are some guiding principles for how to improve our language about phenomenology so as to “carve reality at the joints”?2. The Translation Problem: given a mathematical object isomorphic to a system’s phenomenology, how do we populate a translation list between its mathematical properties and the part of phenomenology each property or pattern corresponds to?My claim is that these eight sub-problems are necessary to solve consciousness, and in aggregate, may be sufficient.Overall, I would agree that these problems are likely necessary, and possibly sufficient. The scale problem is especially important for mapping high-level states of consciousness to low-level physical states, perhaps making the top-down/bottom-up distinction meaningless if it is solved. However, the rest of the paper does not solve these problems, instead discussing valence and simple metrics of it, which don’t solve the above problems.In studying valence, Johnson proposes three postulates:1. Qualia Formalism: for any given conscious experience, there exists – in principle – a mathematical object isomorphic to its phenomenology.2. Qualia Structuralism: this mathematical object has a rich set of formal structures.3. Valence Realism: valence is a crisp phenomenon of conscious states upon which we can apply a measure.Qualia Formalism seems broadly plausible, although I note that it seems at odds with Chalmers’ notion of qualia: the “redness of red” is, in his view, only assessable subjectively, not mathematically. Qualia Structuralism seems very likely. Valence Realism seems likely enough to be a worthy hypothesis.Qualia vary on a number of axes. Qualia can be local (pertaining to only some sensations, e.g. seeing a small patch of green) or global (permeating all sensations, e.g. pleasure). Qualia can be simple or complex, as measured by something like Kolomogorov complexity. Qualia can be atomic or composite (made of multiple parts). And qualia can be intuitively important or intuitively trivial.Johnson proposes that, as qualia objects are mapped to mathematical objects, their properties along these four axes should match with the properties of the corresponding mathematical properties, e.g. intuitively important qualia properties should be intuitively important mathematical properties of the corresponding mathematical objects. This seems broadly reasonable. The properties depend on the structure of the mathematical objects, not just their data content; the notion of a homomorphism in universal algebra and category theory may be relevant.Johnson posits that valence is global, simple, and very interesting; this seems to me likely enough to be a worthy hypothesis.SymmetryThis is where I start actually being annoyed with the paper; not just because the theories presented are overly simple, failing to bridge the ontological stack from physics to phenomenal experience, but also because the metrics of valence presented would straightforwardly be a bad idea to optimize.Johnson reviews some existing neurological theories for clues as to determining valence:“Paul Smolensky’s ‘Computational Harmony’ is a multi-level neurocomputational syntax which applies especially in the natural-language processing (NLP) domain... in short, Smolensky’s model suggests that the organizing principle of successful neurolinguistic computation is simplicity (-> pleasure?), and our NLP systems avoid needless complexity (-> pain?).”“Karl Friston’s Free Energy model of brain dynamics comes to a roughly similar conclusion: ‘[A]ny self-organizing system that is at equilibrium with its environment must minimize its free energy. The principle is essentially a mathematical formulation of how adaptive systems (that is, biological agents, like animals or brains) resist a natural tendency to disorder. ... In short, the long-term (distal) imperative — of maintaining states within physiological bounds — translates into a short-term (proximal) avoidance of surprise. (Friston 2010)’”Both of these theories suggest that simplicity is a proxy for pleasure, and complexity for pain. I am already starting to be concerned: I value interestingness, and interestingness is more like complexity than simplicity. Say Not “Complexity” argues against overly broad identification of complexity with morality, but complexity seems to be to be a better proxy for value than its inverse, simplicity.Fristonian free energy minimization is famously susceptible to the “dark room problem”, than a free energy minimizer may stay in the same dark room so as to minimize the degree to which they are surprised. Scott Alexander discusses this problem and analogizes it to the behavior of depressed people.Johnson discusses more theories based on simplicity and elegance:“Cosmides argues that emotions like grief – or rather, processes like ‘working through grief’ – are actually computationally intensive, and the kind of computation involved with this sort of recalibration of internal regulatory variables seems to intrinsically hurt.”“Pleasurable music tends to involve elegant structure when represented geometrically (Tymoczko 2006).”“To some degree enjoyment of mathematical elegance must be a spandrel, pleasurable because it’s been adaptive to value the ability to compress complexity. . . but pleasure does have to resolve to something, and this is an important data point.”“In fact, ‘dissonance’ and ‘pain’ are often used as rough synonyms. Usually there’s a messy range of valences associated with any given phenomenon – some people like it, some people don’t. But I’ve never heard anyone say, ‘I felt cognitive dissonance and it felt great.’”He goes on to propose a simple theory of valence:Given a mathematical object isomorphic to the qualia of a system, the mathematical property which corresponds to how pleasant it is to be that system is that object’s symmetry.…Symmetry plays an absolutely central role in physics, on many levels. And so if consciousness is a physics problem, then we can say – a priori – that symmetry will play an absolutely central role in it, too, and seems likely to be matched with some qualia as important as valence. I’ll defer to Max Tegmark and Frank Wilczek for a full-throated defense of this notion:This seems to me to be skipping too many levels: mapping symmetry of qualia to symmetry of physics requires mapping the ontologies through multiple levels, not simply using physical symmetry as a proxy for symmetry of qualia, which would tend to result in highly symmetric physical systems, such as uniform rocks, being considered “happy”. Perhaps this is the product of an affective death spiral: symmetry as the highest good, as Schmidhumer considered data compression to be the highest good.Formalizing valence includes formalizing pain: “So – if symmetry/pleasure is accurately approximated by one of the above metrics, could we also formalize and measure antisymmetry/pain and asymmetry/neutral, and combine these to fully specify a mind’s location in valence space? In a word, yes. However, I worry that research into formalizing negative valence could be an information hazard, so I will leave it at this for now.”There is a general problem with formalizing one’s terminal values, which is that they reveal how to minimize one’s values, which can be a problem in a conflict situation, increasing vulnerability to constructs similar to Roko’s basilisk. Conflict is in general a motive for preference falsification.Johnson may notice some of the problems with maximizing symmetry: “An interesting implication we get if we take our hypothesis and apply it to IIT is that if we attempt to maximize pleasure/symmetry, consciousness/Φ drops very rapidly.” While Φ is likely insufficient for consciousness (shown by Aaronson’s expander graph), it may be necessary for consciousness, and if so, low Φ is a sign of low consciousness. It is unsurprising if simple, symmetrical states of information are less conscious, as consciousness requires some degree of complexity for representing a complex situation and associated mental content.Johnson discusses a few ways to test the hypothesis, such as by creating symmetrical or asymmetrical brain states and testing their phenomenological correlates. To me this, again, seems to be skipping ahead too fast: without a more expanded theory of consciousness in general (not just valence) that explains multiple levels of ontological analysis, testing correlations in isolation tells us little, as it does with IIT’s correlation with crude measures of consciousness such as wakefulness.Johnson concludes by discussing applications to treating sentient creatures better and the value problem in artificial intelligence. While I agree that a workable theory of valence would be useful for these applications, I don’t believe we are currently close to such a theory, although the broad research program expressed in the paper, especially the eight problems, is probably a good start for developing such a theory."}
{"title": "Coming soon", "link": "https://unstablerontology.substack.com/p/coming-soon", "date": "2023-06-29T05:56:08.860Z", "content": "This is Unstabler Ontology.Subscribe"}
