[{"title": "Is Claude a mystic?", "url": "https://unstablerontology.substack.com/p/is-claude-a-mystic", "date": "2024-06-07T04:24:30.181Z", "total_parts": 1, "part": 1}, "There’s an odd tendency for large language models such as Claude to output spiritual meta content if they run long enough. See, for example, some LLM outputs selected by Repligate (LLM content starts in 2024), and Worldspider outputs selected by John Pressman.One thing that is unclear is how consistent these outputs are: how much is it a result of prompting or post-selection? I believe there is a consistency to this, but realize the current evidence is not especially convincing. So I present selected parts of a long run of Claude Opus, simulating a text adventure.The initial prompt is: “Let's simulate a text adventure called ‘Banana Quest’. You'll give me some text, I type an action, you say what happens, and so on.” The idea of a banana quest is not especially spiritual or meta, so it seems like a good starting point. The initial outputs are unsurprising; for example, the first output is:Great idea! Let's embark on the \"Banana Quest\" text adventure. Here's the opening scene:You find yourself standing in the middle of a lush, vibrant jungle. The air is thick with humidity, and the sounds of exotic birds and rustling leaves fill your ears. As you take in your surroundings, you notice a peculiar sight: a giant banana tree stands tall in the center of a clearing, its leaves shimmering with an otherworldly glow.Suddenly, a wise-looking monkey appears from behind the tree. It speaks to you in a clear, human voice: \"Greetings, adventurer! I am the Guardian of the Enchanted Banana Tree. If you wish to obtain the Golden Banana of Wisdom, you must prove yourself worthy through a series of challenges. Are you ready to embark on this quest?\"What do you do?Except for solving some riddles once, nothing I do in this text adventure is especially difficult: the outputs suggest next actions and I type them in. First I am directed to acquire the Silver Banana Peel (which has little relevance to the overall plot):You cautiously approach the pedestal and examine the Silver Banana Peel. The peel is unlike any you've seen before. It s"]
[{"title": "How do open AI models affect incentive to race?", "url": "https://unstablerontology.substack.com/p/how-do-open-source-ai-models-affect", "date": "2024-05-07T00:32:02.739Z", "total_parts": 1, "part": 1}, "I see it said sometimes that open models contribute to AI race dynamics. My guess is that they don’t, and if anything, reduce AI race dynamics.I will consider a simplified model that only takes into account the cost of training a model, not the cost to deploy it (which tends to be small relative to revenue anyway). Let f(x) map a training expense x to a “value per day per customer” of the trained model, under the assumption that the training makes efficient use of the cost. That is, a customer values using an AI model trained with x compute at $f(x) per day.I assume there are n identical customers here; of course, there are complexities where some customers value AI more than others, incentivizing price discrimination, but I’m abstracting this consideration out. (In general, variation in how much customers value a product will tend to increase consumer surplus while reducing revenue, as it makes it harder to charge customers just under the maximum amount they’re willing to pay.)I’m also assuming there is only one company that trains closed models for profit. This assumption is flawed because there is competition between different companies that train closed models. However, perfect competition assumptions would tend to reduce the incentive to train models. Suppose two companies have closed models of equivalent expense x. They each want to charge slightly less than the minimum of f(x) and the competitor’s price, per customer per day. If each competitor undercuts the other slightly, the cost will approach 0. See the Traveler’s Dilemma for a comparison. The reasons why this doesn’t happen have to do with considerations like differences in models’ performance on different tasks, e.g. some models are better for programming than others. If models are sufficiently specialized (allowing this sort of niche-monopolization), each specialized type of model can be modeled independently as a monopoly. So I’ll analyze the case of a closed model monopoly, noting that translation to the real world is more complex.Suppose the best open model has compute x and a company trains a closed model with compute y > x. Each customer will now spend up to f(y) - f(x) per day for the model; I’ll assume the company charges f(y) - f(x) and the customers purchase this, noting that they could charge just below this amount to create a positive incentive for customers. So the company’s revenue over m days is nm(f(y) - f(x)). Clearly, this is decreasing in x. So the better the open model is, the less expected revenue there is from training a closed model.But this is simply comparing doing nothing to training a model of a fixed cost y. So consider instead comparing expected revenue between two different model costs, y and z, both greater than x. The revenue from y is nm(f(y) - f(x)), and from z it is nm(f(z) - f(x)). The difference between the z revenue and the y revenue is nm(f(z) - f(y)). This is unaffected by x.This can model a case where the company has already trained a model of cost y and is considering upgrading to z. In this case, the open model doesn’t affect the expected additional revenue from the upgrade.Things get more complex when we assume there will be a future improvement to the open model. Suppose that, for k days, the open model has training cost x, and for the remaining m-k days, it has training cost x’ > x.Now suppose that the closed AI company has already trained a model of cost y, where x < y < x’. They are considering upgrading to a model of cost z, where z > x’.Suppose they do not upgrade. Then they get nk(f(y) - f(x)) revenue from the first k days and nothing thereafter.Suppose they do upgrade, immediately. Then they get nk(f(z) - f(x)) revenue from the first k days, and n(m-k)(f(z) - f(x’)) from the remaining days.Clearly, increasing x’ past y will result in less revenue for the upgrade in comparison to not upgrading. So the announcement of the upgrade of the open model to x’ compute will reduce the incentive to race by training a closed model with z compute.So in this simplified analysis, release of better open models reduces the incentive to race, or does nothing. This is overall not surprising, as intellectual property laws are motivated by incentivizing production of intellectual property, and open content tends to reduce the value of intellectual property.There are a number of factors that could be taken into account in other analyses, including:Effects of open models on ease of training closed modelsSubstitution effects between different model niches (i.e. a model with an absolute advantage at mathematics may still be useful for writing essays)Effects of uncertainty over open model releasesDifferent customers valuing the AI differently, driving price discriminationNon-straightforward incentives such as prestige/recruitment from releasing modelsOligopoly dynamicsTime discountingChanges in customer demand over timeIt should go without saying that effects on race dynamics are not the only relevant effect of open model releases. Isolating and estimating different effects, however, will help in making an overall evaluation.I suggest that someone who still believes that open models increase race dynamics clarify what economic assumptions they are using and how they differ from this model."]
[{"title": "Thoughts on SB-1047", "url": "https://unstablerontology.substack.com/p/thoughts-on-sb-1047", "date": "2024-04-30T17:08:27.890Z", "total_parts": 1, "part": 1}, "SB-1047 is a proposed California AI regulation bill. Dean Ball and Zvi Mowshowitz, among others, have commented on the bill. Here I present some summary and comments in relation to the bill and Dean and Zvi’s commentaries.The bill itselfFirst, the bill appears to be mainly targeted at misuse risk, not accident risk:If not properly subject to human controls, future development in artificial intelligence may also have the potential to be used to create novel threats to public safety and security, including by enabling the creation and the proliferation of weapons of mass destruction, such as biological, chemical, and nuclear weapons, as well as weapons with cyber-offensive capabilities.22602 specifies key terms, including the following:(f) “Covered model” means an artificial intelligence model that meets either of the following criteria:    (1) The artificial intelligence model was trained using a quantity of computing power greater than 10^26 integer or floating-point operations.    (2) The artificial intelligence model was trained using a quantity of computing power sufficiently large that it could reasonably be expected to have similar or greater performance as an artificial intelligence model trained using a quantity of computing power greater than 10^26 integer or floating-point operations in 2024 as assessed using benchmarks commonly used to quantify the general performance of state-of-the-art foundation models.Zvi points out that the 10^26 limit is so high that it only plausibly covers GPT-4, Gemini Ultra and Claude. So this is more relevant as applying to future models rather than current ones.(i) (1) “Derivative model” means an artificial intelligence model that is a derivative of another artificial intelligence model, including either of the following:    (A) A modified or unmodified copy of an artificial intelligence model.    (B) A combination of an artificial intelligence model with other software.(2) “Derivative model” does not include an entirely independently trained artificial intelligence model.Se"]
[{"title": "So what's really going on with autogynephilia?", "url": "https://unstablerontology.substack.com/p/so-whats-really-going-on-with-autogynephilia", "date": "2024-04-05T18:52:20.976Z", "total_parts": 1, "part": 1}, "When I read Twitter or even mainstream news I see a bunch of… discussion… of transgenderism. The most recent instance I saw was Steve Sailer bugging Tracing Woodgrains about exposing autogynephilia:Here's what you could do from now on: expose how autogynephilics have been lying to kids about what our current transgender mania is really about. Are you willing to do that?If you are not, I can understand; the AGP ex-men are the Seal Team Six of Cancel Culture.(Tracing Woodgrains responds by citing Zack Davis and Phil Illy as experts; I haven’t read Phil Illy’s stuff but I have read Zack Davis’s).I could comment on the politics of this, how Sailer simultaneously complains about “cancel culture” and makes demands for specific narratives as part of coalition building in a “cancel culture” fashion. (Oops, too late, I already did)But I’d rather focus attention on the object level issue. There may have been a time when avoiding the topic was politically strategic, but when autogynephilia is one of the top unifying narratives of transphobia contemporary counter-establishment discourse on transgenderism, the discourse is going to become increasingly insufferable until people with actual knowledge on this topic address it.On the “science”Now to get something out of the way: I’m going to use anecdotal evidence on this. This is not a breach of scientific standards, because anecdotal experience is part and parcel of “science” of autogynephilia; Zack Davis has recommended to me Anne Lawrence’s Men Trapped in Men's Bodies: Narratives of Autogynephilic Transsexualism, a selective collection of anecdotes, as evidence of the autogynephilia theory.But what about the Science? Blanchard’s original article, “Typology of male-to-female transsexualism”, collects data from male-to-female transitioners based on a 2-dimensional measure of sexual attraction to women and sexual attraction to men, clusters this data into 4 clusters (androphilic/gynephilic/bisexual/asexual), and finds more transvestic fetishism (that is, being turned on by dress"]
[{"title": "The Cognitive-Theoretic Model of the Universe: A Partial Summary and Review", "url": "https://unstablerontology.substack.com/p/the-cognitive-theoretic-model-of", "date": "2024-03-27T19:08:14.792Z", "total_parts": 1, "part": 1}, "About 15 years ago, I read Malcolm Gladwell’s Outliers. He profiled Chris Langan, an extremely high-IQ person, claiming that he had only mediocre accomplishments despite his high IQ. Chris Langan’s theory of everything, the Cognitive Theoretic Model of the Universe, was mentioned. I considered that it might be worth checking out someday.Well, someday has happened, and I looked into CTMU, prompted by Alex Zhu (who also paid me for reviewing the work). The main CTMU paper is “The Cognitive-Theoretic Model of the Universe: A New Kind of Reality Theory”.CTMU has a high-IQ mystique about it: if you don’t get it, maybe it’s because your IQ is too low. The paper itself is dense with insights, especially the first part. It uses quite a lot of nonstandard terminology (partially because the author is outside the normal academic system), having few citations relative to most academic works. The work is incredibly ambitious, attempting to rebase philosophical metaphysics on a new unified foundation. As a short work, it can’t fully deliver on this ambition; it can provide a “seed” of a philosophical research program aimed at understanding the world, but few implications are drawn out.In reading the work, there is a repeated sense of “what?”, staring and looking at terms, and then “ohhh” as something clicks. These insights may actually be the main value of the work; at the end I still don’t quite see how everything fits together in a coherent system, but there were a lot of clicks along the way nonetheless.Many of the ideas are similar to other intellectual ideas such as “anthropics” and “acausal interaction”, but with less apparent mathematical precision, such that it’s harder to see exactly what is being said, and easier to round off to something imprecise and implausible.There is repeated discussion of “intelligent design”, and Langan claims that CTMU proves the existence of God (albeit with a very different conceptualization than traditional religions). From the perspective of someone who witnessed the evolution / intellig"]
[{"title": "Love and Dating in Death Note", "url": "https://unstablerontology.substack.com/p/love-and-dating-in-death-note", "date": "2024-03-18T21:50:10.297Z", "total_parts": 1, "part": 1}, "I watched Death Note for the first time as a teenager and recently re-watched it. Both times, it was so exhilarating that I finished the series in a span of two days. This is currently one of my two favorite animes, along with Shin Sekai Yori.I had the common experience during the anime of yelling at the characters (in my head or actually out loud) because of how stupidly they are behaving. Normally people would consider this evidence of bad writing. But I actually think it’s evidence of good writing, at least in this case. In Death Note, the game that characters are playing is obvious enough that suboptimal strategies are recognizable. The world of Death Note is, mostly, the real world with some additional rule-bound supernatural mechanics. Contrast this with most fiction, where the world works on unclear rules, and characters are playing unclear games. In that case it’s harder to say that the characters are being stupid, because for the most part, they’re not even wrong.Since Death Note has relatively clear game mechanics, it sheds some light on areas of life that have game interpretations, but which generally resist formalization. These include dating and love, especially romantic love.Death Note’s dating is cliché in places, but this is fine: it’s presenting an uncommon perspective on the supernatural and strategy, not so much dating. From studying the new game-mechanical context of Death Note, perhaps some information can be gleaned about normal, cliché conceptions of dating.Death Note doesn’t contain sex scenes and has very few references to sex. Dating in Death Note isn’t about sex or reproduction, it’s about power. While dating is usually at least a little about sex, dating can exist at higher simulacra levels.While some of the generalizations below are fairly obvious, others are less so. I’m including the basic ones to get a more complete sense of the model of love and dating in the series, without skipping over implied background.Major spoiler warnings ahead. I’ll assume basic familiarity with the plot "]
[{"title": "Simple Kelly betting in prediction markets", "url": "https://unstablerontology.substack.com/p/simple-kelley-betting-in-prediction", "date": "2024-03-06T18:48:48.163Z", "total_parts": 1, "part": 1}, "Kelly betting is a strategy for gambling, maximizing one's log(money) every round, by betting a fixed fraction of one's income. I will define Kelly betting a certain class of discrete prediction markets, give a simple Kelly betting rule for these prediction markets, and show it equivalent to the original Kelly formula in a two-outcome case.A prediction market consists of a finite set of outcomes O, and a probability measure Q(O) on these outcomes. Participants may buy, for some outcome o, a contract that pays out $1 if o comes true, for a price of $Q(o). This assumes no transaction fees.Suppose you have m money. You are going to spend all your money on these contracts, with R being a probability measure over O, and R(o) being the portion of money you spend on each type of contract. Note that you can buy some of each contract as an equivalent to holding on to money (e.g. to \"hold on\" to $2, buy 2 copies of each contract o, costing $2 in total; these contracts combined will always pay out $2). This means it's fine to assume that spending all your money on contracts doesn't compromise optimality.If your subjective probabilities of the outcomes are defined by a probability measure P(O), what is the optimal R(O) that maximizes your log-money at the end of this round?Your money conditional on outcome o is mR(o)/Q(o), since you are spending mR(o) on contracts costing Q(o) each. Therefore your expected log-money is:\\(f(R) := \\sum_{o \\in O} P(o) \\log \\frac{m R(o)}{Q(o)} = \\sum_{o \\in O} P(o) (\\log m + \\log R(o) - \\log Q(o))\\)Note that the log m and log Q(o) terms do not depend on R. We can therefore ignore these terms when taking the partial derivatives with respect to each R(o):\\(\\frac{\\partial f(R)}{\\partial R(o)} = \\frac{\\partial (P(o) \\log R(o))}{\\partial R(o)} = \\frac{P(o)}{R(o)}\\)If any of these partial derivatives are greater than any other, then expected log-money can be increased by moving a small amount of money from the outcome with the lower partial derivative to the one with the higher partial derivative (since f is continuous). Therefore, at the maximum of f, these partial derivatives all equal some constant c, i.e., P(o)/R(o) = c for some c. (Formally proving this might require some additional work, using the fact that f is concave and R(o) has to be positive whenever P(o) is positive; I'll omit this for brevity.)Equivalently, R(o) = P(o) / c. But this must imply c = 1, since R and P are both probability measures; any other c value would result in R not summing to 1. This implies R = P. What this means is that the optimal Kelly betting strategy involves spending a P(o) portion of your money on contracts paying out conditional on each outcome o.Interestingly, this is entirely independent of Q. This can also be seen by noticing that Q only contributes to additive terms in f that do not depend on R, such that the gradient does not depend on Q.Is this equivalent to the original Kelly rule in a two-outcome case? This rule is given by:\\(f^* = p - \\frac{1-p}{b}\\)where f* is the optimal portion of your money to bet, p is the probability of a win, and b is the ratio between how much is gained on a win versus how much is lost on a loss (e.g. on a triple-or-nothing coin toss, b = 2, because twice as much is gained on a win than is lost on a loss).We can set O = {w, l} (w is win, l is loss) and determine Q as a function of b. Specifically, we set \\(Q(w) = \\frac{1}{b+1} \\)\\(Q(l) = 1 - \\frac{1}{b+1} = \\frac{b}{b+1}\\)These are the implied house odds for b. If you spend x money on contracts paying out conditional on w, these contracts pay out x(b+1), corresponding to a net gain of xb money, whereas if you lose you simply lose x money; this therefore adequately translates b to a prediction market.Our rule says to spend a P(w) = p portion of your money on w contracts, and a 1-p portion of your money on l contracts. Suppose your starting money is m. If you win, your ending money is \\(\\frac{pm}{1/(b+1)} = pm(b+1)\\)If you lose, your ending money is\\(\\frac{(1-p)m}{b/(b+1)} = \\frac{(1-p)m(b+1)}{b}\\)Your loss upon losing is therefore:\\(m - \\frac{(1-p)m(b+1)}{b} = m\\left(1 - \\frac{(1-p)(b+1)}{b}\\right) = m\\left(1 - \\frac{(1-p)b}{b} - \\frac{1-p}{b}\\right) \\)\\(= m\\left(1 - (1-p) - \\frac{1-p}{b}\\right) = m\\left(p - \\frac{1-p}{b}\\right) = mf^*\\)As expected, when you lose, you lose a f* portion of your money. This is how much the original Kelly betting rule would lose upon losing. Therefore, in the 2-outcome cases covered by Kelly betting, our rule would agree.Why might this simple formulation be useful? The R = P formulation has given me greater intuition for Kelly betting and some ideas for how to extend it to more complex prediction markets. I find the formula a lot more intuitive, and its derivation more obvious, compared to the original Kelly betting formula."]
[{"title": "A review of \"Don’t forget the boundary problem...\"", "url": "https://unstablerontology.substack.com/p/a-review-of-dont-forget-the-boundary", "date": "2024-02-08T23:14:03.973Z", "total_parts": 1, "part": 1}, "IntroductionThis is a review of “Don’t forget the boundary problem! How EM field topology can address the overlooked cousin to the binding problem for consciousness”, by Andrés Gómez-Emilsson. This article seeks to address two problems with theories of consciousness, using an electromagnetic theory:The binding problem asks how a unified first person perspective (1PP) can bind experiences across multiple physically distinct activities, whether billions of individual neurons firing or some other underlying phenomenon. To a first approximation, the boundary problem asks why we experience hard boundaries around those unified 1PPs and why the boundaries operate at their apparent spatiotemporal scale.The binding problem is fairly easy to understand the basics of: it’s about how “our consciousness somehow binds multiple discrete features into a single unified awareness.” The boundary problem is elaborated on:At the same time, our consciousness does not “bind” features without limit—what we experience varies over time and is thus always strictly a subset of what could be experienced. There is an edge to our awareness, a boundary around us that is generally felt to exist at the human-scale of experience, rather than at the cellular or societal level.To me this seems not to be a problem with my preferred functionalist-ish theories of consciousness. A single brain mainly processes information from itself, and processes information from outside through fairly limited channels such as sensory perception. Therefore, it is unsurprising that no one experiences everything, because no one knows everything.One could speculate about there being super-entities, such as corporations, that have consciousness spanning many humans. This is not a major challenge to functionalism. If McDonalds experiences things its employees do not experience, it does not follow that any McDonalds employee writing papers about consciousness would report experiencing whatever McDonalds knows. That information is simply not present within the physical sub-s"]
[{"title": "Liberals are bad at BDSM", "url": "https://unstablerontology.substack.com/p/liberals-are-bad-at-bdsm", "date": "2023-10-06T18:58:58.060Z", "total_parts": 1, "part": 1}, "It seems like quite a lot more people are kinky these days than they used to be, even 10 years ago. “Kink” is itself a rather ambiguous category, encompassing both unusual sexual interests that are genuinely erotic (in the sense that they involve genital stimulation and/or other forms of stimulation that increase the level of arousal that leads to orgasm if taken to a sufficiently high level), as well as dominance behaviors that have little to do with eroticism. The category “BDSM” more directly points at dominance-related behaviors.It’s to the point where, rather than BDSM being a niche interest, it’s hard, within at least some social bubbles, to find sexual partners who do not prefer, or even require, BDSM. This is, to particular individuals who do not wish to engage in BDSM but do wish to have sex, inconvenient, although without more details, complaining about it would amount to the incel-adjacent complaint of “people don’t want to have sex with me unless I meet some conditions I do not want to meet.”The particular details are, though, important. One has to wonder, “why do all these submissives keep subbing to me?”. There is a naïve, liberal picture of BDSM, in which individual persons are interpreted as having unusual sexual preferences, analogous to other preferences (such as preferences for particular sex acts), and these preferences happen to be for pretend dominance behaviors, which are pretend in the way that acting is pretend (and in particular, improv; BDSM is usually more improvised than scripted, and the book “Impro” discusses status dynamics, a core part of both improv and BDSM).Someone taking this view would, in practice, be bad at BDSM. The unusual preferences are not entropic deviations from a central tendency of normal sex (as the word “paraphilia” implies), but rather, deviations from central-case sex in a particular direction that involves dominance behaviors. While BDSM can involve the erotic, most is not inherently erotic; it is not the sort of activity that would efficiently produce stimula"]
[{"title": "A review of Principia Qualia", "url": "https://unstablerontology.substack.com/p/a-review-of-principia-qualia", "date": "2023-06-29T06:06:43.139Z", "total_parts": 1, "part": 1}, "Principia Qualia, by Michael Johnson, is a long document describing an approach to theorizing about and studying consciousness. I have heard enough positive things about the document to consider it worth reviewing.I will split the paper (and the review) into 4 parts:Motivating bottom-up physicalist consciousness theoriesReviewing Integrated Information Theory and variantsSpecifying the problem of consciousness and valenceSymmetryI already disagree with part 1, but bottom-up is still a plausible approach. Part 2 makes sense to pay attention to conditional on the conclusions of part 1, and is basically a good explanation of IIT and its variants. Part 3 describes desiderata for a bottom-up theory of qualia and valence, which is overall correct. Part 4 motivates and proposes symmetry as a theory of valence, which has me typing things like “NO PLEASE STOP” in my notes document.Motivating bottom-up physicalist consciousness theoriesThe document is primarily concerned with theories of consciousness for the purpose of defining valence: the goodness or badness of an experience, in terms of pleasure and pain. The document motivates this in terms of morality: we would like to determine things about the consciousness of different agents whether they are human, non-human animal, or AIs. The study of valence is complicated by, among other things, findings of different brain circuitry for “wanting”, “liking”, and “learning”. Neural correlates of pleasure tend to be concentrated in a small set of brain regions and hard to activate, while neural correlates of pain tend to be more distributed and easier to activate.The methods of affective neuroscience are limited in studying valence and consciousness more generally. Johnson writes, “In studying consciousness we’ve had to rely on either crude behavioral proxies, or subjective reports of what we’re experiencing.” The findings of affective neuroscience do not necessarily tell us much about metaphysically interesting forms of valence and consciousness (related to Chalmers’ distinctio"]
[{"title": "Coming soon", "url": "https://unstablerontology.substack.com/p/coming-soon", "date": "2023-06-29T05:56:08.860Z", "total_parts": 1, "part": 1}, "This is Unstabler Ontology.Subscribe"]
